Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/ShiftStatementApprovalAssignment/ShiftStatementApprovalAssignmentSystem.*.resx
Languages: ru

# Action_RefuseDescription
source: Complete the assignment with the "For Rework" result.
ru: Выполнение задания с результатом "На доработку".

# Action_RefuseConfirmationMessage
source: Are you sure you want to complete the assignment with the "For Rework" result?
ru: Вы действительно хотите выполнить задание с результатом "На доработку"?

# Action_RefuseHint
source: Complete with "For Rework" Result
ru: Выполнить с результатом "На доработку"

# Enum_Result_Refuse
source: For rework
ru: На доработку

# Action_Refuse
source: For Rework
ru: На доработку

# AccusativeDisplayName
source: Assignment
ru: Задание

# Enum_Result_ForReapproving
source: Corrected
ru: Исправлено

# Action_ForReapproving
source: Corrected
ru: Исправлено

# Action_ForReapprovingHint
source: Send for Reapproval
ru: Отправить на повторное согласование

# Action_ForReapprovingConfirmationMessage
source: Are you sure you want to complete the assignment with the "Corrected" result?
ru: Вы действительно хотите выполнить задание с результатом "Исправлено"?

# Action_ForReapprovingDescription
source: Send an assignment to reapprove the new vacation dates.
ru: Отправка на повторное согласование новых дат отпуска.

# Action_StopConfirmationDescription
source: If you complete the assignment with this result, the date change procedure will be aborted without changes in scheduled dates.
ru: Выполняя задание с этим результатом, вы прекращаете изменение отпуска и оставляете запланированные ранее даты.

# Ribbon_VacationsGroup_199365b8220248749c9ad7ab900a1ff1
source: Vacations
ru: Отпуска

# Enum_Result_Stop
source: Abort
ru: Прекратить

# Action_Stop
source: Abort
ru: Прекратить

# Action_StopHint
source: Complete with "Abort" Result
ru: Выполнить с результатом "Прекратить"

# Action_StopConfirmationMessage
source: Are you sure you want to abort the dates change procedure without changing the scheduled vacation dates?
ru: Вы действительно хотите прекратить изменение отпуска и оставить запланированные ранее даты?

# Action_StopDescription
source: Abort the dates change procedure without changing current dates of vacation.
ru: Прекращение переноса отпуска без изменения запланированных ранее дат.

# Property_ShiftReason
source: Reason
ru: В связи с

# ControlGroup_779bd83b376449feb067876959810ad9
source: Reason for Change
ru: Причина переноса

# Footer_ActiveEmptyText
source: Type the text of assignment...
ru: Введите текст задания...

# Action_ShowChartHint
source: Open Vacation Schedule with Overlaps
ru: Посмотреть график отпусков сотрудников с пересечением

# Action_ShowChartDescription
source: Open vacation schedule with overlaps for review.
ru: Представление графика отпусков сотрудников с пересечением в удобном для проверки виде.

# Property_VacationKind1
source: Vacation type
ru: Вид отпуска

# Property_VacationKind2
source: Vacation type
ru: Вид отпуска

# Property_VacationKind3
source: Vacation type
ru: Вид отпуска

# Property_RecallDate
source: Date of recall
ru: Дата отзыва

# Property_Vacation1
source: Vacation
ru: Отпуск

# Property_Vacation2
source: Vacation
ru: Отпуск

# Property_Vacation3
source: Vacation
ru: Отпуск

# Property_DataBegin1
source: Beginning date
ru: Начало

# Property_DataBegin2
source: Beginning date
ru: Начало

# Property_DataBegin3
source: Beginning date
ru: Начало

# Property_Duration1
source: Days
ru: Количество дней

# Property_Duration2
source: Days
ru: Количество дней

# Property_Duration3
source: Days
ru: Количество дней

# Property_DataEnd1
source: End date
ru: Окончание

# Property_DataEnd2
source: End date
ru: Окончание

# Property_DataEnd3
source: End date
ru: Окончание

# Property_VacationInfo
source: Days of vacation unchanged
ru: Количество неперенесенных дней отпуска

# Property_LiquidationInfo
source: Days of vacation canceled/compensated with payment
ru: Количество отмененных/компенсированных дней отпуска

# Property_Year
source: Vacation year
ru: Год отпуска

# ControlGroup_0e30a87063df41218af87dbe9f07a66c
source: New Vacation Dates
ru: Новые даты отпуска

# ControlGroup_62383c03a082484c97c8bd6b1cf8bd8f
source: Vacation Periods
ru: Периоды отпусков

# Action_ShowChart
source: Show Overlaps
ru: Посмотреть пересечения

# Property_Compensation
source: Compensate/cancel
ru: Компенсировать/отменить

# ControlGroup_1b292c219d794939beffe2d659cd6d48
source: Recall Parameters
ru: Параметры отзыва

# Enum_Result_Approve
source: Approve
ru: Согласовать

# Action_Approve
source: Approve
ru: Согласовать

# Action_ApproveHint
source: Complete with "Approve" Result
ru: Выполнить с результатом "Согласовать"

# Action_ApproveConfirmationMessage
source: Are you sure you want to perform assignment with result "Approve"?
ru: Вы действительно хотите выполнить задание с результатом "Согласовать"?

# Action_ApproveDescription
source: Complete the assignment with the "Approve" result.
ru: Выполнение задания с результатом "Согласовать".

# Property_Employee
source: Employee
ru: Сотрудник

# Property_EnabledCompensationLabel
source: Characteristic availability Compensate / Cancel
ru: Доступность признака Компенсировать/Отменить

# Property_IgnoreRequiredDuration
source: Do not check duration of vacation period
ru: Отключить контроль продолжительности одной части отпуска

# Property_IsRequiredDurationBroken
source: Is required duration broken
ru: Нарушена проверка на наличие минимальной продолжительности отпуска?

# Property_IsFromEssAccount
source: Work in Employee Self Service
ru: Работа в личном кабинете

# Enum_Result_Deny
source: Deny
ru: Отказать

# Action_Deny
source: Deny
ru: Отказать

# Action_DenyHint
source: Perform with result "Deny"
ru: Выполнить с результатом "Отказать"

# Action_DenyConfirmationMessage
source: Are you sure you want to perform assignment with result "Deny"?
ru: Вы действительно хотите выполнить задание с результатом "Отказать"?

# Action_DenyDescription
source: Perform assignment with result "Deny"
ru: Выполнение задания с результатом "Отказать"

# Property_ShowInSelfServiceOffice
source: Show in self-service office
ru: Показать в личном кабинете
