Repository: Micros11/base
Catalog: DirRX.HRLite/DirRX.HRLite.Shared/HRAcquaintanceTask/HRAcquaintanceTask.*.resx
Languages: ru

# ErrorTextRefuseNoActiveText
source: Specify the reason for refusal and complete the assignment.
ru: Укажите причину отказа в подписании и выполните задание.

# ErrorTextForRevisionNoActiveText
source: Type your comments and complete the assignment.
ru: Напишите замечания и выполните задание.

# NeedEndorsingSignature
source: Sign the document with the "Endorse" result before completing the assignment.
ru: Перед выполнением задания необходимо подписать документ ЭП с результатом "Согласовано".

# AcquaintanceTaskSubject
source: Signing: {0}
ru: Подписание: {0}

# SignatorySubject
source: Sign: {0}
ru: Подпишите: {0}

# AuthorReworkSubject
source: Rework: {0}
ru: Доработайте: {0}

# EmployeeAcquaintanceSubject
source: Get acquainted: {0}
ru: Ознакомьтесь: {0}

# RefusalSubject
source: Process refusal to sign document: {0}
ru: Обработайте отказ в подписании: {0}

# PrepareRefuseActSubject
source: Generate protocol on refusal to sign document: {0}
ru: Сформируйте акт об отказе в подписании документа: {0}

# NotAllEmployeeAcquaintance
source: Some employees cannot get aqcuainted with the document in digital form.
ru: Не все сотрудники будут ознакомлены в электронном виде.

# AcquaintanceNotESSEmployeeSubject
source: Get the employees who are not connected to the Employee Self Service or who have not signed the Consent acquainted with the document: {0}
ru: Организуйте ознакомление с документом сотрудников, не подключенных к личному кабинету или не подписавших Согласие на КЭДО: {0}

# RefuseNoticeSubject
source: Document signing denied: {0}
ru: Отказ от подписания: {0}

# AcquaintanceListIndexNumber
source: No.
ru: № п/п

# AcquaintanceListEmployeeName
source: Full Name
ru: ФИО сотрудника

# AttachmentError
source: You can send for acquaintance only an HR document or a Company regulation.
ru: На ознакомление можно отправлять только кадровые документы и локальные нормативные акты.

# AddendaTypeError
source: The addendum type does not conform to the type of the document to sign.
ru: Тип приложения не соответствует типу документа на подписание

# AcquaintanceListJobTitle
source: Job Title
ru: Должность

# AcquaintanceListStatus
source: State
ru: Статус

# AcquaintanceListDate
source: Date
ru: Дата

# AcquaintanceListCommentary
source: Note
ru: Комментарий

source: Acquaintance List
ru: ЛИСТ ОЗНАКОМЛЕНИЯ

# EmployeeGotAcquainted
source: Signed using ES
ru: Подписано ЭП

# EmployeeRefusedToAcquaintance
source: Refused to Sign
ru: Отказано в подписании

# AcquaintanceReportDialogName
source: Acquaintance Report
ru: Отчет об ознакомлении

source: Departments
ru: Подразделения

# ExcludeSigned
source: Exclude already acquanted employees
ru: Не включать ознакомившихся

# BusinessUnit
source: Business units
ru: Наша организация

# EmptyDocumentError
source: The document to sign doesn't have versions. Create a version or select another document.
ru: Документ на подписание не содержит версий. Создайте хотя бы одну версию документа или выберите другой документ.

# EmptyAddendaError
source: Addendum "{0}" does not have versions. Create a document version or select another document.
ru: Приложение "{0}" не содержит версий. Создайте хотя бы одну версию документа или выберите другой документ.

# PDFConvertError
source: An error has occurred when using the Apose Words library. The document hasn't been converted to PDF.
ru: При работе с библиотекой Apose Words произошла ошибка. Документ не был преобразован в PDF.

# AuthorConvertErrorsReworkSubject
source: Errors occurred when converting document or its addenda: {0}
ru: Произошли ошибки при преобразовании документа или его приложений: {0}

# DocumentNameWithError
source: An error occurred when working with document {0} ({1}): {2}.
ru: При работе с документом {0} ({1}) произошла ошибка: {2}

# AddendaKindError
source: The addendum document kind does not conform to the kind of the document to sign.
ru: Вид документа приложения не соответствует виду документа на подписание

# ExpectedTaskDeadlineInfo
source: Estimated task completion date: {0}.
ru: Ожидаемый срок завершения задачи: {0}.

# ApproveDeadlineDaysError
source: The approval deadline must be greater than 0.
ru: Срок согласования должен быть больше 0.

# EmployeeDealineDaysError
source: The acquaintance deadline must be greater than 0.
ru: Срок ознакомления должен быть больше 0.

# SignatoryDeadlineDaysError
source: The deadline for signing by a manager must be greater than 0.
ru: Срок подписания руководителем должен быть больше 0.

# SignatoryFieldIsEmpty
source: A manager is not specified. The document will be sent for acquaintance without prior approval and signing.
ru: Не заполнено поле "Руководитель". Документ будет отправлен на ознакомление без согласования и подписания.
