Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/Aspirant/AspirantSystem.*.resx
Languages: ru

# Property_Name
source: Full name
ru: ФИО

# DisplayName
source: Candidate
ru: Кандидат

# AccusativeDisplayName
source: Candidate
ru: Кандидата

# CollectionDisplayName
source: Candidates
ru: Кандидаты

# Action_CreateReportDescription
source: Generate a report on the candidate.
ru: Создание отчета по кандидату.

# Action_CreateReport
source: Generate Report
ru: Создать отчет

# Property_Person
source: Person
ru: Персона

# Action_StartRecruitmentTask
source: Send for Review
ru: Отправить на рассмотрение

# Action_StartRecruitmentTaskDescription
source: Send a task to review the candidate.
ru: Старт задачи на рассмотрение кандидата.

# Action_StartRecruitmentTaskHint
source: Send Candidate for Review
ru: Отправить кандидата на рассмотрение

# Property_RecruitmentState
source: Review status
ru: Статус рассмотрения

# Enum_RecruitmentState_Draft
source: Draft
ru: Новый

# Enum_RecruitmentState_OnApproval
source: Under review
ru: На рассмотрении

# Enum_RecruitmentState_Refused
source: Denied
ru: Отказано

# Enum_RecruitmentState_Delayed
source: Reserve
ru: Резерв

# Property_Report
source: Report on candidate
ru: Отчет по кандидату

# Action_CreateReportHint
source: Generate Report on Candidate
ru: Создать отчет по кандидату

# Ribbon_Documents_a24f5b4f24c34661b6b5bd6614fbc987
source: Documents
ru: Документы

# Action_ShowAspirantDocuments
source: Documents on Candidate
ru: Документы по кандидату

# Action_ShowAspirantDocumentsDescription
source: Open the list of documents on the candidate.
ru: Открытие списка документов по кандидату.

# Action_ShowAspirantDocumentsHint
source: Show Documents on Candidate
ru: Показать документы по кандидату

# Ribbon_Documents_fbdd1377de9f46369d25f943dd3f8cf1
source: Documents
ru: Документы

# Action_StartHiringTask
source: Employ Candidate
ru: Оформить кандидата

# Action_StartHiringTaskDescription
source: Start a task to employ the candidate.
ru: Старт задачи на прием кандидата.

# Action_StartHiringTaskHint
source: Employ Candidate
ru: Оформить кандидата

# Enum_RecruitmentState_Approved
source: Approved
ru: Одобрен

# Ribbon_SendTasks_94bc5abc113843b6b7b21da2080e2138
source: Tasks on Candidate
ru: Работа с кандидатом

# Ribbon_SendTasks_b5583c2eb3f64264874f8f48c69b977d
source: Tasks on Candidate
ru: Работа с кандидатом
