Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/RecruitmentTask/RecruitmentTask.*.resx
Languages: ru

# ManagerAssignmentSubject
source: Prepare to review candidate: {0}
ru: Подтвердите готовность к рассмотрению кандидата: {0}

# ManagerAssignmentInstruction
source: 1. Read the report on the candidate. 2. If you are ready to review the candidate for employment to your department, confirm it in the assignment text. 3. Complete the assignment.
ru: 1. Ознакомьтесь с отчетом по кандидату. 2. Укажите в тексте задания готовность рассматривать кандидата на трудоустройство в ваше подразделение. 3. Выполните задание.

# PlanMeetingHRAssignmentSubject
source: Record results of department managers' interview with candidate: {0}
ru: Зафиксируйте результаты после встречи руководителей с кандидатом: {0}

# PlanMeetingHRAssignmentInstruction
source: If there are department managers ready to review the candidate: 1. Arrange a meeting with the candidate for the managers. Record the meeting results in the candidate report. 2. Specify the meeting participants and complete the assignment with the "Complete" result. If there are no department managers ready to review the candidate, or the review procedure must be aborted, complete the assignment with the "Deny" result.
ru: Если есть руководители, готовые рассмотреть кандидата: 1. Организуйте встречу руководителей с кандидатом. По результатам встречи зафиксируйте информацию в отчете по кандидату. 2. Укажите участников встречи в соответствующем поле и выполните задание с результатом "Выполнить". Если нет руководителей, готовых рассмотреть кандидата, или необходимо прекратить работы по рассмотрению кандидата, выполните задание с результатом "Отказать".

# ManagerReportAssignmentInstruction
source: 1. Read the report on the candidate. 2. Record the meeting results in the candidate report and make decision on the employment of the candidate to your department. 3. Complete the assignment.
ru: 1. Ознакомьтесь с отчетом по кандидату. 2. Зафиксируйте информацию по результатам встречи в отчете по кандидату и примите решение по трудоустройству кандидата в ваше подразделение. 3. Выполните задание.

# ManagerReportAssignmentSubject
source: Record meeting results and make decision on employment: {0}
ru: Зафиксируйте информацию и примите решение по трудоустройству кандидата: {0}

# SeoReportAssignmentSubject
source: Approve employment of candidate: {0}
ru: Утвердите трудоустройство кандидата: {0}

# SeoReportAssignmentInstruction
source: Make decision on employment of the candidate: 1. If you decide to employ the candidate, complete the assignment with the "Approve" result. 2. If you decide not to employ the candidate, complete the assignment with the "Deny" result.
ru: Примите решение по трудоустройству кандидата: 1. Если принято положительное решение по трудоустройству кандидата, то выполните задание с результатом "Утвердить". 2. Если принято отрицательное решение по трудоустройству кандидата, то выполните задание с результатом "Отказать".

# PlanSecurityAssignmentSubject
source: Request necessary documents and information from candidate: {0}
ru: Запросите необходимые документы и сведения у кандидата: {0}

# PlanSecurityAssignmentInstruction
source: 1. Request and receive the documents for the Security Department from the candidate. 2. If needed, send the personal data processing agreement to the candidate and make sure it is returned. 3. Complete the assignment with the "Complete" result. If the review procedure must be aborted, complete the assignment with the "Deny" result.
ru: 1. Запросите и получите от кандидата необходимые документы для службы безопасности. 2. При необходимости отправьте кандидату для подписания согласие на обработку персональных данных и проконтролируйте его возврат. 3. Выполните задание с результатом "Выполнить". Если необходимо прекратить работы по рассмотрению кандидата, то выполните задание с результатом "Отказать".

# SecurityAssignmentSubject
source: Check information on candidate: {0}
ru: Проверьте сведения о кандидате: {0}

# SecurityAssignmentInstruction
source: Read the information on the candidate and enter your recommendations and comments in the assignment text. Complete the assignment.
ru: Ознакомьтесь с информацией по кандидату и зафиксируйте рекомендации и комментарии в тексте задания. Выполните задание.

# PrepareHiringAssignmentSubject
source: Take further actions on candidate employment: {0}
ru: Выполните необходимые действия по дальнейшей работе с кандидатом: {0}

# PrepareHiringAssignmentInstruction
source: Take further actions on candidate employment: 1. If you need to start the employment procedure, click the "Employ" button, fill in the required fields and start the task. 2. If you need to finish the review for now and start the employment procedure later, complete the assignment with the "Add to Reserve" result. 3. If you need to abort the candidate review procedure, complete the assignment with the "Deny" result.
ru: Выполните необходимые действия по дальнейшей работе с кандидатом: 1. Если необходимо инициировать работы по приему кандидата, то нажмите на кнопку "Принять на работу", заполните поля и стартуйте задачу. 2. Если инициировать работы по приему кандидата необходимо позже, а на текущий момент необходимо завершить работы по рассмотрению кандидата, то выполните задание с результатом "Перевести в резерв". 3. Если необходимо прекратить работы по рассмотрению кандидата, то выполните задание с результатом "Отказать".

# TaskSubject
source: Candidate review: {0}
ru: Рассмотрение кандидата: {0}

# AbortNotice
source: Candidate review complete: {0}
ru: Завершено рассмотрение кандидата: {0}

# PlanSeoAssignmentSubject
source: Make decision on employment of candidate: {0}.
ru: Зафиксируйте решение по трудоустройству кандидата: {0}

# PlanSeoAssignmentInstruction
source: Read the report on the candidate: 1. If there are department managers ready to employ the candidate, discuss the employment with them and record the decision in the assignment text. 2. If there are no department managers ready to employ the candidate, complete the assignment with the "Deny" result.
ru: Ознакомьтесь с отчетом по кандидату: 1. Если имеются руководители, готовые к трудоустройству кандидата, то, при необходимости обсудите вопросы с руководителями и зафиксируйте решение в тексте задания. 2. Если нет руководителей, готовых к трудоустройству кандидата, выполните задание с результатом "Отказать".

# ActiveTextOnCreate
source: Please review the candidate.
ru: Прошу рассмотреть кандидата.
