Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/VacationAlertTask/VacationAlertTask.*.resx
Languages: ru

# VacationAlertTaskSubject
source: Confirm scheduled vacation {0} from {1} to {2}
ru: Подтверждение планового отпуска {0} с {1} по {2}

# VacationApprovalAssignmentSubject
source: Confirm vacation dates from {0} to {1}
ru: Подтвердите даты отпуска с {0} по {1}

# VacationApprovalAssignmentInstruction
source: Review the notice: 1. Make sure that the specified dates are correct. 2. Check the substitute specified in the "Substitute" field and change it if necessary. 3. Complete the assignment with the "Confirm" result. The notice will be signed automatically. 4. If you need to change the dates of the vacation, complete the assignment with the "Change Vacation Dates" result.
ru: Ознакомьтесь с уведомлением: 1. Проверьте, что отпуск планируется в указанные даты. 2. В поле "Замещающий" проверьте замещающего на время отпуска. При необходимости измените замещающего. 3. Выполните задание с результатом "Подтвердить". Уведомление будет подписано автоматически. 4. Если необходимо перенести отпуск, выполните задание с результатом "Перенести отпуск".

# AccounterAssignmentInstruction
source: Do the necessary financial operations related to the vacation of the employee and complete the assignment.
ru: Осуществите необходимые финансовые операции в соответствии с отпуском сотрудника и выполните задание.

# AccounterAssignmentSubject
source: Take necessary actions on vacation: {0}
ru: Выполните необходимые работы в связи с отпуском {0} с {1} по {2}

# ShiftTaskAbortingReasons
source: The task to change vacation dates was aborted automatically as the change was not approved in due time.
ru: Задача на перенос отпуска была прекращена автоматически, так как перенос не согласован вовремя.

# AccounterAssignmentAbortingInstruction
source: The change of vacation dates was canceled. The scheduled vacation dates were not changed.
ru: Перенос отпуска прекращен, использование отпуска осуществляется в запланированные даты.

# AccounterAssignmentShiftExpiredInstruction
source: The change of vacation dates was not approved in due time. The scheduled vacation dates were not changed.
ru: Перенос отпуска не согласован вовремя, отпуск будет исполнен в запланированные даты.

# ManagerNoticeSubject
source: Confirm scheduled vacation {0} from {1} to {2}
ru: Подтверждение планового отпуска {0} с {1} по {2}

# SubstitutionChangeSubject
source: Specify substitute
ru: Укажите замещающего

# EmployeeFieldName
source: Employee
ru: Сотрудник

# SubstitutionWillBeChanged
source: The substitution will be corrected.
ru: Замещение будет скорректировано.

# VacationApprovedSubject
source: Vacation of {0} from {1} to {2} confirmed
ru: Подтвержден отпуск {0} с {1} по {2}

source: Vacation
ru: Отпуск

# VacationApprovedInstruction
source: The substitute for the vacation period is {0}. If necessary, change the substitution by clicking "Change Substitution".
ru: Замещающий на время отпуска – {0}. При необходимости скорректируйте замещение, нажав кнопку "Изменить замещение".

# SubstitutionWillBeCreated
source: The substitution will be created.
ru: Замещение будет создано.

# SubstitutionWillBeDeleted
source: The substitution will be deleted.
ru: Замещение будет удалено.

# SignPaperDocAssignmentSubject
source: Make sure {0} prints and signs notice on vacation beginning
ru: Проконтролируйте печать и подписание сотрудником {0} уведомления о начале отпуска

# SignPaperDocAssignmentInstruction
source: 1. Review and confirm the notice on vacation beginning. 2. Complete the assignment.
ru: 1. Проверьте и примите уведомление о начале отпуска. 2. Выполните задание.

# VacationApprovalAssignmentAllPaperInstruction
source: Review the notice: 1. Make sure that the specified dates are correct. 2. Check the substitute specified in the "Substitute" field and change it if necessary. 3. Print out and sign the notice. Submit the signed notice to the responsible employee. 4. Complete the assignment with the "Confirm" result. 5. If you need to change the dates of the vacation, complete the assignment with the "Change Vacation Dates" result.
ru: Ознакомьтесь с уведомлением: 1. Проверьте, что отпуск планируется в указанные даты. 2. В поле "Замещающий" проверьте замещающего на время отпуска. При необходимости измените замещающего. 3. Распечатайте уведомление, подпишите и отнесите его ответственному. 4. Выполните задание с результатом "Подтвердить". 5. Если необходимо перенести отпуск, выполните задание с результатом "Перенести отпуск".

# PrintAndSingPaperVacationAlertSubject
source: Print out notice on vacation beginning and submit it to responsible employee
ru: Распечатайте уведомление о начале отпуска и передайте ответственному

# SignVacationAlertShiftDeadlineDocInstruction
source: The change of vacation dates was not approved in due time. The scheduled vacation dates were not changed. 1. Print out and sign the notice. Submit the signed notice to the responsible employee. 2. Complete the assignment.
ru: Перенос отпуска не согласован вовремя, отпуск будет исполнен в запланированные даты. 1. Распечатайте уведомление, подпишите и отнесите его ответственному. 2. Выполните задание.

# SignVacationAlertShiftCanceledDocInstruction
source: The change of vacation dates was canceled. The scheduled vacation dates were not changed. Print out and sign the notice and submit it to the employee responsible for vacations. Complete the assignment.
ru: Перенос отпуска прекращен, отпуск будет исполнен в запланированные даты. 1. Распечатайте уведомление, подпишите и отнесите его ответственному. 2. Выполните задание.

# VacationApprovedWithoutSubstitutionInstruction
source: A substitute for the vacation period is not specified. If necessary, specify the substitute by clicking "Change Substitution".
ru: Замещающий на время отпуска не назначен. При необходимости укажите замещающего, нажав кнопку "Изменить замещение".
