Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/HiringTask/HiringTask.*.resx
Languages: ru

# HiringTaskSubject
source: Hire employee: {0}
ru: Трудоустройство сотрудника: {0}

# PreparingAssignmentSubject
source: Take necessary actions to hire employee: {0}
ru: Выполните необходимые работы в связи с трудоустройством сотрудника: {0}

# HRRegistrationNoPersAgreementInstruction
source: 1. Import all necessary information about the new employee to the system. After that, click "Create Documents" to create HR documents. 2. Print out and have the new employee sign the hard copies of the personal data processing agreement and the letter on joining electronic communication. 3. Complete the assignment.
ru: 1. Занесите в систему все необходимые сведения о новом сотруднике, после чего по кнопке "Создать документы" сформируйте кадровые документы. 2. Распечатайте и организуйте подписание в бумажном виде новым сотрудником согласия на обработку персональных данных и заявления о присоединении к соглашению об электронном взаимодействии. 3. Выполните задание.

# SignAllPaperDocAssignmentSubject
source: Have new employee sign hard copies of employment contract and employment order: {0}
ru: Организуйте подписание в бумажном виде трудового договора и приказа о приеме сотрудника: {0}

# ManagerAssignmentInstruction
source: Meet the new employee and organize the onboarding. Complete the assignment.
ru: Организуйте встречу нового сотрудника и подключение к работе. Выполните задание.

# SignPaperEmploymentContractAssignmentInstruction
source: Print out the employment contract and have its hard copy signed by the HR Department manager and by the new employee. Complete the assignment.
ru: Распечатайте трудовой договор и организуйте его подписание в бумажном виде директором по персоналу и новым сотрудником. Выполните задание.

# SignAllPaperDocAssignmentInstruction
source: 1. Print out the employment contract and order, and then have their hard copies signed by the HR manager. 2. Make sure the new employee signs the hard copy of the employment contract and get the signed acknowledgement of the order. 3. Complete the assignment.
ru: 1. Распечатайте трудовой договор, приказ и организуйте их подписание в бумажном виде директором по персоналу. 2. Организуйте подписание в бумажном виде трудового договора и ознакомление с приказом под подпись новым сотрудником. 3. Выполните задание.

# ITResponsibleAssignmentInstruction
source: 1. Create an account for the new employee. 2. Create a signature setting. If necessary, issue an electronic signature certificate, and then complete the assignment.
ru: 1. Создайте учетную запись для нового сотрудника. 2. Создайте право подписи, при необходимости выдайте сертификат ЭП и выполните задание.

# SecurityResponsibleAssignmentInstruction
source: Prepare an ID card and give it to the new employee. Complete the assignment.
ru: Подготовьте и выдайте пропуск новому сотруднику. Выполните задание.

# SupplyResponsibleAssignmentInstruction
source: Set up a work space for the new employee and complete the assignment.
ru: Подготовьте рабочее место для нового сотрудника и выполните задание.

# SignPaperEmploymentContractAssignmentSubject
source: Have employee sign hard copy of employment contract: {0}
ru: Организуйте подписание в бумажном виде трудового договора с сотрудником: {0}

# SignSeoOrderAndEmploymentContractAssignmentInstruction
source: Read the employment contract and order: 1. If you have no comments, complete the assignment with the "Sign" result. Both documents will be automatically signed once you complete the assignment. 2. If you have any comments, write them down in the assignment text, and then complete the assignment with the "For Rework" result.
ru: Ознакомьтесь с трудовым договором и приказом: 1. Если нет замечаний, то выполните задание с результатом "Подписать" (трудовой договор и приказ будут подписаны автоматически при выполнении задания). 2. Если есть замечания, то зафиксируйте их в тексте задания и выполните задание с результатом "На доработку".

# SignEmploymentDocsSubject
source: Read local regulations, sign employment contract and order with electronic signature
ru: Ознакомьтесь с ЛНА, подпишите ЭП трудовой договор и приказ о приеме

# ReWorkDocsAssignmentInstruction
source: Revise the documents according to the comments and complete the assignment with the "Corrected" result.
ru: Скорректируйте документы в соответствии с замечаниями и выполните задание с результатом "Исправлено".

# ReWorkDocsAssignmentSubject
source: Correct employment documents: {0}
ru: Доработайте документы по трудоустройству сотрудника: {0}

# SignEmploymentContractAssignmentInstruction
source: 1. Read local regulations, the employment contract and order. 2. Complete the assignment with the "Sign" result. The employment contract and order will be signed automatically once you complete the assignment.
ru: 1. Ознакомьтесь с локальными нормативными актами, трудовым договором и приказом. 2. Выполните задание с результатом "Подписать" (трудовой договор и приказ будут подписаны автоматически при выполнении задания).

# HRRegistrationInstruction
source: 1. Import all necessary information about the new employee to the system. After that, click "Create Documents" to create HR documents. 2. Print out and have the new employee sign the hard copy of the letter on joining electronic communication. 3. Complete the assignment.
ru: 1. Занесите в систему все необходимые сведения о новом сотруднике, после чего по кнопке "Создать документы" сформируйте кадровые документы. 2. Распечатайте и организуйте подписание в бумажном виде новым сотрудником заявления о присоединении к соглашению об электронном взаимодействии. 3. Выполните задание.

# AbortNotice
source: Employment aborted: {0}
ru: Прекращено трудоустройство сотрудника: {0}

# HiringTaskActiveText
source: Prepare documents for the new employee.
ru: Прошу оформить нового сотрудника.

# SignSeoEmploymentDocsSubject
source: Sign employment contract and order with electronic signature: {0}
ru: Подпишите ЭП трудовой договор и приказ о приеме нового сотрудника: {0}

# ErrorTextReWorkNoActiveText
source: Leave your comments in the assignment text before you complete the assignment with the "For Rework" result.
ru: Перед выполнением задания с результатом "На доработку" укажите замечания в тексте задания.
