Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/ModuleSystem.*.resx
Languages: ru

# DisplayName
source: Commons HR Pro
ru: Общие компоненты HR Pro

# CoverTitle
source: Personnel Flow
ru: Движение персонала

# CoverGroup_PersonnelChanges
source: My human resource changes
ru: Мои кадровые изменения

# CoverDescription_StartHiringTask
source: Send a new employment task.
ru: Отправка задачи на прием сотрудника.

# CoverAction_StartDismissalTask
source: Create Resignation Letter
ru: Оформить заявление на увольнение

# CoverDescription_StartDismissalTask
source: Send a task to approve a resignation.
ru: Отправка задачи на согласование заявления на увольнение.

# CoverDescription
source: This module is where you can automate HR personnel flow.
ru: Модуль предназначен для автоматизации работы по перемещению персонала.

# CoverGroup_Recruitment
source: HR Management
ru: Управление персоналом

# CoverAction_Aspirant
source: Candidates
ru: Кандидаты

# CoverDescription_Aspirant
source: View the list of candidates.
ru: Просмотр списка кандидатов.

# CoverAction_AspirantReview
source: Review Candidate
ru: Рассмотрение кандидата

# CoverDescription_AspirantReview
source: Send a task to review a candidate.
ru: Отправка задачи на рассмотрение кандидата.

# JobDisplayName_4cc23d2754e34d5c9611bd1628e05078
source: HR Processes. Delete Documents
ru: HR-процессы. Удаление документов из системы

# JobDescription_4cc23d2754e34d5c9611bd1628e05078
source: Delete documents from the system.
ru: Удаление документов из системы.

# JobDisplayName_0619414eb0ba425f90ddc5221cc0e8d9
source: HR Processes. Send Tasks to Confirm Vacations
ru: HR-процессы. Отправка задач на подтверждение отпуска

# JobDescription_0619414eb0ba425f90ddc5221cc0e8d9
source: Send tasks to confirm vacations.
ru: Отправка задач на подтверждение отпуска по графику.

# JobDisplayName_e70dbad252ab43999fc844d019d6ff3b
source: HR Processes. Automatically Complete Assignment with Notice on Vacation Beginning
ru: HR-процессы. Автоматическое выполнение задания с уведомлением о начале отпуска

# JobDescription_e70dbad252ab43999fc844d019d6ff3b
source: Automatically complete an assignment with notice on the vacation beginning.
ru: Автоматическое выполнение задания с уведомлением о начале отпуска.

# CoverAction_ModuleSettings
source: Module Settings
ru: Настройки модуля

# CoverDescription_ModuleSettings
source: Configure the module settings.
ru: Задать настройки модуля.

# JobDisplayName_3a1401b010eb48faaee1a2614b67ca41
source: HR Processes. Change Vacations Statuses
ru: HR-процессы. Изменение состояния отпусков

# JobDescription_3a1401b010eb48faaee1a2614b67ca41
source: Change vacation statuses from "In process" to "Complete".
ru: Изменение состояния отпусков на "Исполняется" и "Исполнен".

# JobDescription_6fad5d689e314b57a62e63c4772ef839
source: Send tasks to schedule vacations.
ru: Отправка задач на планирование графика отпусков.

# JobDisplayName_6fad5d689e314b57a62e63c4772ef839
source: HR Processes. Send Tasks to Schedule Vacations
ru: HR-процессы. Отправка задач на планирование отпусков

# JobDisplayName_ba283b6c03594501ad97867155097fae
source: HR Processes. Automatically Complete Assignment to Schedule Vacation
ru: HR-процессы. Автоматическое выполнение задания на планирование отпуска

# JobDescription_ba283b6c03594501ad97867155097fae
source: Automatically complete an assignment to schedule the vacation.
ru: Автоматическое выполнение задания на планирование отпуска.

# AsyncHandler_Description_7eb6e314ee4a4756874139cae6b7eb79
source: Change a substitution.
ru: Изменение замещения.

# AsyncHandler_Description_e66f070089a64c93b9a822dfd37cca34
source: Create a substitution.
ru: Создание замещения.

# AsyncHandler_Description_f0fe0f45e16c400090deae2a4a3d3262
source: Delete a substitution.
ru: Удаление замещения.

# AsyncHandler_Description_71698e22ee58447e82a522a2c1adbd04
source: Set vacation statuses to "Scheduled" after signing by HR manager
ru: Перевести отпуска в состояние "Запланирован" после подписания директором по персоналу

# CoverAction_StartHiringTask
source: Employ
ru: Оформить сотрудника

# CoverGroup_Setting
source: Settings
ru: Настройки

# AsyncHandler_Description_c1611523933644da946fd0d58d4b3567
source: Abort Subtasks to Schedule Vacations in Departments
ru: Прекратить подзадачи по планированию в подразделениях

# CoverAction_ExportDocuments
source: Export Documents on Movement of Employees
ru: Выгрузить документы по перемещению персонала

# CoverDescription_ExportDocuments
source: Export documents on movement of employees by specified parameters.
ru: Выгрузка документов по перемещению персонала по заданным параметрам.

# CoverGroup_ExportDocument
source: ExportDocument
ru: Выгрузка документов

# CoverAction_StartTransferTaskAsEmployee
source: Change My Terms of Employment
ru: Оформить изменение условий труда

# CoverDescription_StartTransferTaskAsEmployee
source: Send a task to change terms of employment.
ru: Отправка задачи на изменение условий труда.

# CoverAction_StartTransferTaskAsManager
source: Change Terms of Employment of Employee
ru: Оформить изменение условий труда сотрудника

# CoverDescription_StartTransferTaskAsManager
source: Send a task to change the employee's terms of employment.
ru: Отправка задачи на изменение условий труда сотрудника специалистом отдела кадров.

# AsyncHandler_Description_eed6d88e9a754efb88ffc1680b1b6279
source: Refresh employees' property "Consent for Digital HR Document Management"
ru: Обновить свойство "Согласие на КЭДО" у сотрудников

# JobDisplayName_4d5a8db317194f19aa04e9360ff3e47d
source: HR Processes. Send notice to employees with several jobs
ru: HR-процессы. Отправка уведомлений совместителям

# JobDescription_4d5a8db317194f19aa04e9360ff3e47d
source: Send notices to employees with several jobs about new or overdue assignments of the employees they substitute.
ru: Отправка совместителям уведомлений о новых или просроченных заданиях замещаемых сотрудников.
