Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/Module.*.resx
Languages: ru

# RoleDescrHiringSecurityResponsible
source: A specialist of the Security Department.
ru: Специалист службы безопасности.

# RoleNameHiringITResponsible
source: IT Department Specialist
ru: Специалист ИТ-подразделения

# RoleNameHiringResponsible
source: HR Specialist
ru: Специалист по работе с персоналом

# RoleNameHiringSupplyResponsible
source: Facilities Department Specialist
ru: Специалист административно-хозяйственной службы

# RoleNameHiringSecurityResponsible
source: Security Department Specialist
ru: Специалист службы безопасности

# RoleDescrHiringITResponsible
source: A specialist of the IT Department.
ru: Специалист ИТ-подразделения.

# RoleDescrHiringSupplyResponsible
source: A specialist of the Facilities Department.
ru: Специалист административно-хозяйственной службы.

# EmploymentContractKindName
source: Employment contract
ru: Трудовой договор

# HRDocumentTypeName
source: HR Document
ru: Документ по переводу и отпускам

# ElectronicInteractionAgreementKindName
source: Electronic communication agreement
ru: Соглашение об электронном взаимодействии

# ProcPersonalDataAgreementKindName
source: Personal data processing agreement
ru: Согласие на обработку персональных данных

# HROrderTypeName
source: HR order
ru: Кадровый приказ

# DismissalStatementKindName
source: Resignation letter
ru: Заявление на увольнение

# TransferAdditionalAgreementKindName
source: Supplemental agreement on transfer to another department
ru: Дополнительное соглашение о переводе в другое подразделение

# TransferAdditionalAgreementKindShortName
source: Supp. agreement on transfer to another department
ru: Доп. соглашение о переводе в другое подразделение

# RoleDescrStaffChief
source: HR Department manager.
ru: Директор по персоналу.

# RoleNameStaffChief
source: HR Manager
ru: Директор по персоналу

# TransferOrderKindName
source: Transfer order
ru: Приказ о переводе

# DismissalOrderKindName
source: Resignation order
ru: Приказ об увольнении

# RoleNameAccounter
source: Accountant
ru: Специалист бухгалтерии

# RoleDescrAccounter
source: An accountant.
ru: Специалист бухгалтерии.

# VacationOrderKindName
source: Vacation order
ru: Приказ об отпуске

# VacationShiftOrderKindName
source: Vacation dates change order
ru: Приказ о переносе отпуска

# AbortReason
source: Reason
ru: Причина

# RoleNameVacationResponsible
source: Employee Responsible for Business Unit Vacation Schedule
ru: Ответственный за график отпусков в организации

# RoleDescrVacationResponsible
source: A user responsible for managing the vacation schedule in the business unit.
ru: Пользователь, ответственный за график отпусков в организации и внесение в него изменений.

# ScheduledVacationNoticeKindName
source: Notice on scheduled vacation beginning
ru: Уведомление о начале отпуска

# HiringOrderKindName
source: Order on employment
ru: Приказ о приеме

# AspirantReportKindName
source: Report on job candidate
ru: Отчет по кандидату

# AspirantDocTypeName
source: HR document on candidate
ru: Документ по кандидату

# JoiningStatementKindName
source: Letter on joining electronic communication
ru: Заявление о присоединении к электронному взаимодействию

# BenefitStatementKindName
source: Benefit request letter
ru: Заявление на выплату пособия

# MaterialAidStatementKindName
source: Financial support request letter
ru: Заявление на выплату материальной помощи

# ChangePersonalDataStatementKindName
source: Letter on personal data change
ru: Заявление на изменение персональных данных

# VacationStatementKindName
source: Vacation request letter
ru: Заявление на отпуск

# VacationShiftStatementKindName
source: Letter on vacation dates change
ru: Заявление на перенос отпуска

# OtherAspirantDocKindName
source: Other documents on candidate
ru: Прочие документы по кандидату

# ChangePersonalDataRuleName
source: Default rule for letters on personal data change
ru: Правило по умолчанию для заявлений на изменение персональных данных

# GetEmployeeDocStageName
source: Get documents from employee
ru: Получение документов от сотрудника

# GetEmployeeDocStageSubject
source: Receive necessary documents from employee
ru: Примите необходимые документы у сотрудника

# ChangeEmployeeDataStageName
source: Change employee personal data
ru: Внесение изменений

# ChangeEmployeeDataStageSubject
source: Change employee personal data
ru: Внесите необходимые изменения

# MaterialPaymentsRuleName
source: Default rule for letters on payments
ru: Правило по умолчанию для заявлений, связанных с денежными выплатами

# MaterialPaymentStageName
source: Transfer money
ru: Выдача денежных средств

# MaterialPaymentStageSubject
source: Transfer money
ru: Выдайте денежные средства

# AcquaintanceListKindName
source: Local regulations acknowledgement form
ru: Лист ознакомления со списком ЛНА

# VacationDurationOverLimit
source: Allowed duration of "{0}" is exceeded by {1} days.
ru: Для вида "{0}" превышено допустимое количество дней отпуска на {1}.

# VacationNoRequiredDurationPart
source: One of scheduled vacation parts for "{1}" must be at least {0} days.
ru: Продолжительность одного из планируемых периодов для вида отпуска "{1}" должна составлять не менее {0} дней.

# VacationDurationUnderLimit
source: Unscheduled days for "{0}": {1}.
ru: Для вида "{0}" осталось незапланированных дней отпуска: {1}.

# VacationIntervalIncorrectPeriod
source: The paid vacation cannot begin earlier than {0}. If necessary, apply for an unpaid vacation from {1} to {2}.
ru: Ближайшая доступная дата начала оплачиваемого отпуска – {0}. Если необходимо отсутствовать с {1} по {2}, оформите отпуск без сохранения заработной платы.

# VacationScheduleKindName
source: Vacation schedule
ru: График отпусков

# VacationIntersectionsPeriod
source: Found overlapping vacation period: {0} – {1}.
ru: Есть пересекающиеся даты отпуска: {0} – {1}.

# VacationChartDialogHeader
source: Vacation Schedule with Overlaps
ru: График отпусков с пересечениями

# DeparmentFieldName
source: Department
ru: Подразделение

# BusinessUnitFieldName
source: Business unit
ru: Наша организация

# Employee
source: Employee: {0}
ru: Сотрудник: {0}

# PlannedVacationLeftSubject
source: Scheduled days of paid vacation left: {0}.
ru: Осталось запланированных оплачиваемых дней отпуска: {0}.

# VacationChartLegendWarning
source: - weeks when more than {0}% of the department employees will be on vacation.
ru: - недели, в которые в отпуске будут более {0}% сотрудников отдела.

# CantSeeVacationsByNonEmployee
source: Only the employees can view the vacation databook. Log on to the system using an employee account.
ru: Просмотр отпусков доступен только сотрудникам. Войдите в систему под учетной записью сотрудника.

# VacationChartLegendError
source: - employees with errors in their vacation schedule.
ru: - сотрудники, у которых присутствуют ошибки в отпусках.

# VacationChartLegendCurrentDate
source: - current date.
ru: - текущая дата.

# EmployeeFieldName
source: Employee
ru: Сотрудник

# YearFieldName
source: Year
ru: Год

# DocumentDeleteFailed
source: Failed to delete the document.
ru: При удалении документа произошла ошибка.

# WhithoutPayVacationLeftSubject
source: Days of unpaid vacation used: {0}.
ru: Использовано дней без сохранения з/п: {0}.

# NoDataToGenerateReport
source: No report data found.
ru: Нет данных для формирования отчета.

# VacationIntervalIncorrectDay
source: The paid vacation cannot begin earlier than {0}. If necessary, apply for an unpaid vacation on {1}.
ru: Ближайшая доступная дата начала оплачиваемого отпуска – {0}. Если необходимо отсутствовать {1}, оформите отпуск без сохранения з/п.

# VacationIntersectionsDay
source: Found overlapping vacation date: {0}.
ru: Есть пересекающаяся дата отпуска: {0}.

# VacationChartLegendManager
source: - department manager.
ru: - руководитель подразделения.

# VacationEndBeforeWeekendOrHoliday
source: The vacation end date is a day before a weekend or a holiday.
ru: Отпуск заканчивается перед выходным или праздничным днем.

# RoleNameVacationManagers
source: Employees Responsible for Department Vacation Schedule
ru: Ответственные за график отпусков в подразделении

# RoleDescrVacationManagers
source: Users that can change vacations of employees of their department.
ru: Пользователи, имеющие права на изменение отпусков в своем подразделении.

# VacationEndOverBorderCalendarYear
source: Vacations in the business unit are being scheduled for the period from {0} to {1}. The vacation from {2} to {3} must be scheduled in this period.
ru: В данный момент в организации идет планирование отпусков на период с {0} по {1}. Отпуск {2} – {3} должен попадать в указанный период.

# VacationIntervalIncorrect
source: The paid vacation cannot begin earlier than {0}.
ru: Ближайшая доступная дата начала оплачиваемого отпуска – {0}.

# CanSendTaskByRole
source: Only an employee included in role "{0}" or his or her substitute can send the task.
ru: Отправить задачу может только сотрудник, входящий в роль "{0}", или его замещающий.

# NoWorkingTimeCalendar
source: No working calendar found for year {0}.
ru: Отсутствует календарь рабочего времени за {0}.

# OverflowDuration
source: The vacation duration exceeds allowed limits.
ru: Продолжительность отпуска превышает разрешенные значения.

source: Departments without managers:
ru: Подразделения без руководителей:

# SettingsReportName
source: Report on Configuration Consistency for HR Processes Module as of {0}
ru: Отчет по корректности настройки системы для модуля "HR-процессы" на {0}

# UsersWithoutLogins
source: Employees without accounts:
ru: Неавтоматизированные сотрудники:

# DepartmentsWithoutBusinessUnit
source: Departments with empty "Business unit" field:
ru: Подразделения с пустым полем "Наша организация":

# UsersWithoutLoginsInRoles
source: Roles that include employees without accounts:
ru: Роли, в которых есть неавтоматизированные сотрудники:

# CanCreateSettingsReport
source: Only users included in the "{0}" role can generate the report.
ru: Сформировать отчет могут только пользователи, входящие в роль "{0}".

# SettingsCorrect
source: The configuration of departments, roles, and employees is consistent.
ru: Подразделения, роли и сотрудники настроены корректно.

# SchedulingAssignmentAutoComplete
source: The assignment to schedule a vacation was not completed in due time. The vacation is automatically allocated to the period from {0} to {1}.
ru: Задание на планирование не было выполнено в срок. Отпуск автоматически распределен на даты с {0} по {1}.

# SubstitutionWasChanged
source: The department manager has changed the substitute to {0}
ru: Руководитель скорректировал замещающего на {0}

# SubstitutionWasDeleted
source: The department manager has removed the substitute
ru: Руководитель удалил замещающего

# SubstitutionWasCreated
source: The department manager has specified the substitute: {0}
ru: Руководитель указал замещающего: {0}

# EmployeeActiveOnly
source: Active employees only
ru: Только действующие сотрудники

# NoVacationDurationRecord
source: The assignment to schedule a vacation was not completed in due time. The vacation was not scheduled as the "Vacation Durations" databook has no relevant record.
ru: Задание на планирование не было выполнено в срок. Отпуск не распределен, так как отсутствует запись в справочнике "Продолжительности отпусков".

# BusinessUnitsRoleWithoutRecipients
source: No performers are specified in {0} for the following roles:
ru: В нашей организации "{0}" отсутствуют исполнители следующих ролей:

# ScheduleAcquaintanceListKindName
source: Vacation schedule acknowledgement form
ru: Лист ознакомления с графиком отпусков

# ActualShceduleReport
source: Current Vacation Statuses
ru: Актуальное состояние отпусков

# OnlyPaidFieldName
source: Paid vacations only
ru: Только оплачиваемые

# ActualReportHeader
source: Report on Current Vacation Statuses
ru: Отчет об актуальном состоянии отпусков

# ReportDateBegin
source: Beginning Date
ru: Дата начала

# ReportDateEnd
source: End Date
ru: Дата окончания

# ReportStatus
source: Status
ru: Статус

# ReportBaseDocs
source: Supporting Documents
ru: Документы-основания

# RoleNameHRAdministrator
source: HR Processes Administrator
ru: Администратор HR-процессов

# RoleDescrHRAdministrator
source: The administrator of the "HR Processes" module.
ru: Администратор модуля "HR-процессы".

# AlertStatmentVacationText
source: {0} for {1} days from {2}
ru: {0} продолжительностью {1} календарных дней с {2}

# VacationEndOverBorderCalendarYearForShift
source: The new vacation dates from {2} to {3} must be scheduled in the period from {0} to {1}.
ru: Новые даты отпуска {2} – {3} должны приходиться на период с {0} по {1}.

# VacationEndOverBorderCalendarYearForAdmin
source: The vacation from {2} to {3} must be scheduled in the period from {0} to {1}.
ru: Отпуск {2} – {3} должен приходиться на период с {0} по {1}.

# VacationStatementBodyPart
source: {0} for {1} days from {2}
ru: {0} продолжительностью {1} календарных дней с {2}

# NotAvailableEmployeeVacationKind
source: Specified vacation type "{0}" ({1} days) is not available to the employee for year {2}.
ru: Используется вид отпуска "{0}" ({1} д.), который недоступен сотруднику в {2} году.

# ActualReportHeaderData
source: {0} for {1} as of {2}
ru: {0} за {1} от {2} г.

# VacationEndOverBorderCalendarYearForSingleSchedule
source: You are scheduling vacations for the period from {0} to {1}. The vacation from {2} to {3} must be scheduled in the specified period.
ru: Вы планируете отпуска в периоде с {0} по {1}. Даты отпуска {2} – {3} должны приходиться на указанный период.

# VacationOrderBodyPart
source: {0} for {1} days from {2} to {3}
ru: {0} продолжительностью {1} календарных дней с {2} по {3}

# VacationOrderTotalDurationText
source: Total vacation duration is {0} days.
ru: Всего отпуск на {0} календарных дней.

# VacationRecallStatementKindName
source: Letter on recall from vacation
ru: Заявление на отзыв из отпуска

# VacationRecallOrderKindName
source: Order on recall from vacation
ru: Приказ об отзыве из отпуска

# ReportVacationKind
source: Vacation Type
ru: Вид отпуска

source: Overlaps
ru: Пересечения

source: Export Documents
ru: Выгрузка документов

# ExportParamsDialogInstruction
source: Specify search criteria and parameters to export documents
ru: Укажите критерии поиска и параметры выгрузки документов

# DocumentKindFieldName
source: Doc. kind
ru: Вид документа

# YearFromFieldName
source: Year from
ru: Год с

# PeriodFromFieldName
source: Date from
ru: Дата с

# YearToFieldName
source: Year to
ru: Год по

# PeriodToFieldName
source: Date to
ru: Дата по

# ExportFormatFieldName
source: Format
ru: Формат

# ExportFormatElectronicDocuments
source: In electronic form
ru: В электронном виде

# ExportFormatPaperDocuments
source: For printing
ru: Для печати

# NextButton
source: Next
ru: Далее

# FileListButton
source: Show Documents
ru: Показать документы

# BackButton
source: Back
ru: Назад

# ExportButton
source: Export
ru: Выгрузить

# CloseButton
source: Close
ru: Закрыть

# CancelButton
source: Cancel
ru: Отмена

# ExportDialog_Instruction
source: Documents to export found - {0}
ru: Найдено документов - {0} 1. Для просмотра найденных документов для выгрузки нажмите "Показать документы". 2. Чтобы изменить параметры выгрузки, вернитесь к окну выбора параметров по кнопке "Назад". 3. Для выгрузки документов нажмите "Выгрузить".

# ExportDialog_Error_DocumentCountLimit
source: There are over {0} documents to export. Correct the search criteria.
ru: Количество документов для выгрузки превышает {0}. Скорректируйте критерии поиска.

# ExportDialog_ResultsInfo
source: Documents have been exported. Total documents: {0} - electronic documents signed with all required signatures: {1} - electronic documents signed with some of required signatures: {2} - scanned copies of paper documents: {3} Documents with errors: {4}
ru: Документы выгружены. Выгружено документов: {0} - электронные документы с полным комплектом подписей: {1} - электронные документы с неполным комплектом подписей: {2} - скан-копии бумажных документов: {3} Документов с ошибками: {4}

# ExportDialog_Error_NoVersion
source: Document has no content
ru: У документа нет содержимого

# ExportDialog_Error_Client
source: An error occurred while exporting document {0}
ru: Произошла ошибка при выгрузке документа ({0})

# ExportLogTemplate
source: ID:{0} Name:{1} Error:{2}
ru: ИД:{0} Наименование:{1} Ошибка:{2}

# NoFullComplectSignatureFolderName
source: Electronic Documents with Incomplete Set of Signatures
ru: Электронные документы с неполным комплектом подписей

# FullComplectSignatureFolderName
source: Electronic Documents with Complete Set of Signatures
ru: Электронные документы с полным комплектом подписей

# ExportDocumentFolderName
source: Export dated {0}
ru: Выгрузка от {0}

# ExportDialog_Error_Client_NoReason
source: An error occurred while preparing documents. Contact your system administrator.
ru: Произошла ошибка при подготовке документов. Обратитесь к администратору.

# ExportDialog_Error_ExportedFilesLimit
source: There are over {0} files to export. Correct the list of documents to export.
ru: Количество файлов превышает {0}. Скорректируйте список документов для выгрузки.

# ExportDialog_Error_ExportedSizeLimit
source: There are over {0} MB of files to export. Correct the list of documents to export.
ru: Объем файлов превышает {0} МБ. Скорректируйте список документов для выгрузки.

# ExportDialog_SuccessInfo
source: Now you can export the documents.
ru: Документы доступны для выгрузки.

# RoleNameHRDocExportManager
source: Employees responsible for exporting HR documents
ru: Ответственные за выгрузку кадровых документов

# RoleDescrHRDocExportManager
source: Users who are authorized to export HR documents of the business unit.
ru: Пользователи, имеющие право выгружать кадровые документы организации.

# CanExportHRDocuments
source: Only an employee included in role "{0}" or "{1}", or his or her substitute can export documents.
ru: Выгрузка документов может производиться только участником роли "{0}" или "{1}", либо их замещающими.

# ExportDatesError
source: Value in the "Date from" field cannot be greater than the value in the "Date to" field.
ru: Значение в поле "Дата с" не может быть больше, чем значение в поле "Дата по".

# ExportYearsError
source: Value in the "Year from" field cannot be greater than the value in the "Year to" field.
ru: Значение в поле "Год с" не может быть больше, чем значение в поле "Год по".

# CantSendTaskByManagerError
source: Only a manager, participant of role {0}, or their substitute can send a task to change the employee's terms of employment.
ru: Задача на изменение условий труда сотрудника инициируется только руководителем, участником роли "{0}" или их замещающими.

# VacationChartLegendAnotherYear
source: - another year.
ru: - другой учетный год.

# ChangeWorkConditionsAdditionalAgreementKindName
source: Supplemental agreement to changes in terms of employment
ru: Дополнительное соглашение об изменении условий труда

# ChangeWorkConditionsAdditionalAgreementKindShortName
source: Supp. agreement to changes in terms of employment
ru: Доп. соглашение об изменении условий труда

# ChangeWorkConditionsOrderKindName
source: Terms of employment change order
ru: Приказ об изменении условий труда

# RoleConfigurationHeader
source: Configure Roles of Business Unit
ru: Настройка ролей по нашей организации

# CanConfigureRoles
source: Only employees included both in roles "{0}" and "Administrators" can configure the list of roles' participants.
ru: Настраивать список участников ролей могут только сотрудники, входящие одновременно в роли "{0}" и "Администраторы".

# SignedInPA
source: {0} from Employee Self Service
ru: {0} через личный кабинет

# VacationDatesNotMatchDuration
source: Vacation period {0} - {1} does not match {2} working days in accordance with working calendar.
ru: Даты отпуска {0} - {1} не соответствуют длительности {2} р.д. с учетом календаря рабочего времемни.

# CopiesOfPaperDocFolderName
source: Scanned Copies of Paper Documents
ru: Скан-копии бумажных документов

# CantCreateActualVacationReport
source: Only an employee included in role "{0}" or his or her substitute can generate the vacation report.
ru: Сформировать отчет о состоянии отпусков может только сотрудник, входящий в роль "{0}", или его замещающий.

# VacationDatesRangeError
source: The vacation end date {1} cannot be earlier than the start date {0}.
ru: Дата окончания отпуска {1} не может быть меньше даты начала {0}.

# RoleNameHRProUsers
source: HR Pro users
ru: Пользователи решения HR Pro

# RoleNamePersonnelFlowUsers
source: Personnel flow users
ru: Пользователи модуля Движение персонала

# RoleNameDescPersonnelFlowUsers
source: Personnel flow all users
ru: Все пользователи использующие функционал модуля Движение персонала

# RoleNameVacationsUsers
source: Vacations users
ru: Пользователи модуля Отпуска

# RoleNameDescVacationsUsers
source: Vacations all users
ru: Все пользователи использующие функционал модуля Отпуска

# DayOffSubjectInWidget
source: Apply for leave from {0} till {1}
ru: Оформление отгула с {0} по {1}

# ShiftVacationSubjectInWidget
source: Change vacation dates to {0} till {1}
ru: Перенос отпуска на даты с {0} по {1}

source: No license Vacations
ru: Для запуска задачи необходима лицензия на модуль "Отпуска".

# NoLicensePersonnel
source: No license Personnel flow
ru: Для запуска задачи необходима лицензия на модуль "Движение персонала".

# ReworkVacationInstruction
source: Click "Rework" to change vacation parameters.
ru: Нажмите на кнопку "Доработать" и измените параметры отпуска.

# VacAppIstructionEss
source: Get acquainted with the document. If you are going to take vacations as scheduled, click "Confirm" and sign the document. If you want to change the vacation periods, click "Change Dates" and specify new dates.
ru: Ознакомьтесь с уведомлением о начале отпуска. Если отпуск планируется в указанные даты, нажмите на кнопку "Подтвердить" и подпишите уведомление. Если отпуск необходимо перенести, нажмите на кнопку "Перенести" и укажите новые даты.

# VacAppIstructionGluedEss
source: Get acquainted with the document. If you are going to take vacations as scheduled, click "Confirm" and sign the document. Some vacation periods are scheduled without working days between them. If you want to change the vacation periods, contact your direct manager or go to the "Applications" section and create an "Other Application". In such case, do not complete this assignment and close the confirmation window.
ru: Ознакомьтесь с уведомлением о начале отпусков. Если отпуска планируются в указанные даты, нажмите на кнопку "Подтвердить" и подпишите уведомление. Несколько отпусков запланированы подряд, и между ними нет рабочих дней. Если отпуска необходимо перенести, обратитесь к непосредственному руководителю или перейдите в раздел "Заявления" и оформите "Прочее заявление". В этом случае не выполняйте задание и закройте окно подтверждения.

# RefusalInstruction
source: By clicking "Send", you refuse to sign the document. It will be marked correspondingly.
ru: Нажимая кнопку "Отправить", вы отказываетесь от подписания этого документа. В нем будет проставлена соответствующая отметка.

# DocumentApprovalOnReworkInstruction
source: Specify your comments and send the document for rework.
ru: Укажите замечания и отправьте документ на доработку.

# AssignmentsToWhoSubstitute
source: Assignments for employee with several jobs
ru: Задания для совместителя
