Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/VacationSchedulingTask/VacationSchedulingTask.*.resx
Languages: ru

# SignAllPaperDocInstruction
source: 1. Print out the vacation schedule. 2. Have the hard copy of the vacation schedule signed by the HR manager. 3. Complete the assignment.
ru: 1. Распечатайте график отпусков. 2. Организуйте его подписание директором по персоналу. 3. Выполните задание.

# SignAllPaperDocSubject
source: Arrange signing of vacation schedule hard copy
ru: Организуйте подписание графика отпусков в бумажном виде

# SignSeoAssignmentInstruction
source: Approve the vacation schedule for year {0}: 1. Review the attached vacation schedule. 2. Complete the assignment with the "Approve" result. The vacation schedule will be signed automatically.
ru: Утвердите график отпусков на {0} год: 1. Ознакомьтесь с графиком отпусков во вложении. 2. Выполните задание с результатом "Утвердить". График отпусков будет подписан автоматически.

# SignSeoAssignmentSubject
source: Approve vacation schedule of {1} for year {0}
ru: Утвердите график отпусков на {0} год в {1}

# CheckVacationScheduleSubject
source: Check vacation schedule of {1} for year {0}
ru: Проверьте график отпусков на {0} год в {1}

# CheckVacationScheduleInstruction
source: Review vacations scheduled for year {0}: 1. Review the scheduled vacations of employees by clicking "Show Overlaps". 2. If you have any remarks, send tasks to correct vacations to the responsible employees. 3. If the vacations are correct, click "Create Vacation Schedule" to generate the document. 4. Complete the assignment.
ru: Проверьте отпуска сотрудников на {0} год: 1. Посмотрите запланированные отпуска сотрудников, нажав кнопку "Посмотреть пересечения". 2. Если к запланированным отпускам есть замечания, отправьте задачи на исправление ответственным. 3. Если к запланированным отпускам нет замечаний, сформируйте график отпусков, нажав кнопку "Создать график отпусков". 4. Выполните задание.

# TaskSubject
source: Schedule vacations in {1} for year {0}
ru: Планирование отпусков на {0} год в {1}

# SchedulingStartSubject
source: Scheduling vacations in business unit {0} for year {1} initiated
ru: Началось планирование отпусков в организации {0} на {1} год

# SchedulingInProgress
source: Scheduling vacations for {0} is in progress.
ru: Планирование отпусков для {0} уже выполняется.

# SignPaperAcquaintanceList
source: Print out the acknowledgement form and have its hard copy signed by the employees.
ru: 1. Распечатайте график отпусков. 2. Организуйте подписание графика отпусков директором по персоналу. 3. Выполните задание.

# SignPaperAcquaintanceListSubject
source: Have hard copy of vacation schedule acknowledgement form for year {1} signed by employees of {0}
ru: Организуйте в {0} подписание листа ознакомления с графиком отпусков на {1} в бумажном виде

# AbortNoticeSubject
source: Scheduling vacations in {1} for year {0} aborted
ru: Прекращено планирование отпусков на {0} год в организации {1}

# AcquaintanceTaskSubject
source: Acknowledgement with document in {0}: {1}
ru: Ознакомление {0} с документом: {1}

# AuthorConvertErrorsReworkInstruction
source: Errors occurred when converting document or its addenda to PDF/A. Convert the following documents manually. {0}
ru: При преобразовании документа или его приложений в формат PDF/A произошли ошибки. Преобразуйте документы вручную. {0}

# AuthorConvertErrorsReworkSubject
source: Errors occurred when converting document or its addenda: {0}
ru: Произошли ошибки при преобразовании документа или его приложений: {0}
