Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/DismissalTask/DismissalTask.*.resx
Languages: ru

# ApprovalAssignmentInstruction
source: Review the parameters of the resignation letter: 1. If the date specified in the "Resignation date" field is invalid, correct it and complete the assignment with the "Approve" result. 2. If the date in the "Resignation date" field is correct, complete the assignment with the "Approve" result. 3. If the resignation letter should be denied, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с параметрами заявления: 1. Если поле "Дата увольнения" заполнено некорректно, укажите корректное значение и выполните задание с результатом "Согласовать". 2. Если поле "Дата увольнения" заполнено корректно, то выполните задание с результатом "Согласовать". 3. Если необходимо отказать в согласовании, то укажите причину в тексте задания и выполните задание с результатом "Отказать".

# ApprovalAssignmentSubject
source: Approve resignation parameters: {0}
ru: Согласуйте параметры заявления на увольнение сотрудника: {0}

# DismissalDocsReWorkAssignmentSubject
source: Rework resignation order: {0}
ru: Доработайте приказ об увольнении сотрудника: {0}

# DismissalDocsReWorkAssignmentInstruction
source: Correct the resignation order in accordance with the specified remarks and complete the assignment with the "Corrected" result.
ru: Скорректируйте приказ в соответствии с замечаниями и выполните задание с результатом "Исправлено".

# PrepareDocAssignmentInstruction
source: Click the "Create Order" button to create the order. Check the order parameters and correct them, if necessary, then complete the assignment.
ru: Сформируйте приказ по кнопке "Создать приказ", при необходимости скорректируйте сформированный документ. Выполните задание.

# PrepareDocAssignmentSubject
source: Create and check resignation order: {0}
ru: Сформируйте и проверьте приказ об увольнении сотрудника: {0}

# SignSeoAssignmentInstruction
source: Review the order: 1. If the order is correct, complete the assignment with the "Sign" result (the order will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result.
ru: Ознакомьтесь с приказом: 1. Если замечания отсутствуют, выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания). 2. Если имеются замечания, то укажите их в тексте задания и выполните задание с результатом "На доработку".

# SignAssignmentSubject
source: Sign resignation order of {0} with your electronic signature
ru: Подпишите ЭП приказ об увольнении сотрудника: {0}

# DismissEmployeeAssignmentInstruction
source: 1. Make necessary changes in HR documents related to the resignation. 2. Have the employee read the personal card with signed acknowledgement. 3. Give the necessary documents to the employee. 4. Complete the assignment.
ru: 1. Внесите необходимые изменения в кадровые документы в связи с увольнением сотрудника. 2. Организуйте ознакомление с личной карточкой под подпись увольняемым сотрудником. 3. Выдайте необходимые документы сотруднику. 4. Выполните задание.

# DismissEmployeeAssignmentSubject
source: Take necessary actions on resignation: {0}
ru: Выполните необходимые работы в связи с увольнением сотрудника: {0}

# ReApproveAssignmentSubject
source: Correct parameters of resignation letter: {0}
ru: Скорректируйте параметры заявления на увольнение сотрудника: {0}

# AccounterDismissEmployeeAssignmentInstruction
source: Do the necessary financial operations related to the resignation of the employee and complete the assignment.
ru: Осуществите необходимые финансовые операции в соответствии с увольнением сотрудника и выполните задание.

# EmployeeGoRoundAssignmentSubject
source: Return the business property to the responsible departments
ru: Верните задолженности в ответственные службы

# RespGoRoundControlAssignmentSubject
source: Collect business property from resigning employee: {0}
ru: Примите задолженности увольняемого сотрудника: {0}

# RespGoRoundAssignmentSubject
source: Check if there is any business property to collect from resigning employee: {0}
ru: Проверьте задолженности увольняемого сотрудника: {0}

# RespGoRoundControlAssignmentInstruction
source: 1. Collect the business property from the employee. 2. Take actions on the employee resignation, if necessary, and complete the assignment.
ru: 1. Примите задолженности у сотрудника. 2. При необходимости выполните работы в связи с увольнением сотрудника и выполните задание.

# EmployeeGoRoundAssignmentIntruction
source: Return the business property to the employees of the responsible departments: {0}
ru: Верните задолженности сотрудникам ответственных служб: {0}

# AbortNotice
source: Resignation procedure aborted: {0}
ru: Прекращен процесс увольнения сотрудника: {0}

# DismissalTaskSubject
source: Process employee resignation: {0}
ru: Увольнение сотрудника: {0}

# ErrorTextReWorkNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Rework" result.
ru: Перед выполнением задания с результатом "На доработку" укажите замечания в тексте задания.

# ErrorTextGoRoundNoActiveText
source: Specify the business property to be returned by the employee in the assignment text before you complete the assignment with the "To Return" result.
ru: Перед выполнением задания с результатом "К возврату" укажите задолженности в тексте задания.

# DeniedNoticeSubject
source: Employee resignation denied: {0}
ru: Отказано в увольнении сотрудника: {0}

# SignStatementAssignmentInstruction
source: Review the resignation letter: 1. If the letter is correct, complete the assignment with the "Sign" result (the letter will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Reapproval" result.
ru: Ознакомьтесь со сформированным заявлением: 1. Если замечания отсутствуют, то выполните задание с результатом "Подписать" (заявление будет подписано автоматически при выполнении задания). 2. Если имеются замечания, то укажите их в тексте задания и выполните задание с результатом "На повторное согласование".

# SignStatementAssignmentSubject
source: Review and sign resignation letter with electronic signature
ru: Проверьте и подпишите ЭП заявление на увольнение

# ApprovalSEOAssignmentInstruction
source: Review the parameters of the resignation letter: 1. If the parameters are correct, complete the task with the "Approve" result. 2. If you have any remarks or the resignation letter should be denied, complete the assignment with the "Deny" result.
ru: Ознакомьтесь с параметрами заявления: 1. Если замечания отсутствуют, то выполните задание с результатом "Согласовать". 2. Если имеются замечания или необходимо отказать в согласовании, то выполните задание с результатом "Отказать".

# SignEmployeeAssignmenInstruction
source: Read the order and complete the assignment with the "Sign" result (the order will be signed automatically upon completion).
ru: Ознакомьтесь с приказом и выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания).

# DismissEmployeeAndPrintDocAssignmentInstruction
source: 1. Print out the order and have its hard copy signed by HR manager. 2. Make necessary changes in HR documents related to the resignation. 3. Print out the resignation letter and have it signed. Have the resigning employee sign the hard copy of the resignation letter, and read the personal card and the resignation order with signed acknowledgement. 4. Give the necessary documents to the employee. 5. Complete the assignment.
ru: 1. Распечатайте приказ и организуйте его подписание в бумажном виде директором по персоналу. 2. Внесите необходимые изменения в кадровые документы в связи с увольнением сотрудника. 3. Распечатайте заявление. Организуйте подписание заявления в бумажном виде, ознакомление с личной карточкой и приказом под подпись увольняемым сотрудником. 4. Выдайте необходимые документы сотруднику. 5. Выполните задание.

# ErrorTextRefuseNoActiveText
source: Specify the reason for denial in the assignment text before you complete the assignment with the "Deny" result.
ru: Перед выполнением задания с результатом "Отказать" укажите причину в тексте задания.

# RespGoRoundAssignmentInstruction
source: Check if the resigning employee has any business property to return: 1. If the employee does not have any business property to return, then take actions on resignation, if necessary, and complete the assignment with the "Done" result. 2. If the employee has property to return, specify the property in the assignment text and complete the assignment with the "To Return" result.
ru: Проверьте, имеются ли задолженности у увольняемого сотрудника: 1. Если отсутствуют, то, при необходимости, выполните работы в связи с увольнением сотрудника и выполните задание с результатом "Работы выполнены". 2. Если имеются, то укажите информацию о них в тексте задания и выполните задание с результатом "К возврату".

# ReApproveAssignmentInstruction
source: Read the remarks: 1. Change the parameters of the resignation letter, if necessary, and complete the assignment with the "Approve" result. 2. If the resignation letter should be denied, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с замечаниями: 1. При необходимости, скорректируйте параметры заявления и выполните задание с результатом "Согласовать". 2. Если необходимо отказать в согласовании, то укажите причину в тексте задания и выполните задание с результатом "Отказать".

# ErrorTextReApproveNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Reapproval" result.
ru: Перед выполнением задания с результатом "На повторное согласование" укажите замечания в тексте задания.

# ActiveTextOnCreate
source: Please approve the resignation of the employee.
ru: Прошу согласовать увольнение сотрудника.

# SignEmployeeAssignmentSubject
source: Sign resignation order with your electronic signature
ru: Подпишите ЭП приказ об увольнении

# ServiceAHOName
source: Facilities Department
ru: Административно-хозяйственная служба

# ServiceITName
source: IT Department
ru: ИТ-подразделение

# ServiceSBName
source: Security Department
ru: Служба безопасности
