Repository: Micros11/base
Catalog: DirRX.HRLite/DirRX.HRLite.Shared/ModuleSystem.*.resx
Languages: ru

# CoverGroup_Setting
source: Settings
ru: Настройки

# CoverTitle
source: Document Management
ru: Кадровый ЭДО

# CoverGroup_CreateDocumentGroup
source: Create Documents
ru: Создание документов

# CoverAction_ImportOrgStructure
source: Import organization structure
ru: Импорт оргструктуры

# CoverDescription_ImportOrgStructure
source: Import organization structure.
ru: Импортировать наши организации, подразделения и сотрудников из Excel-файла.

# CoverDescription_ShowAllLRD
source: Show all local regulation documents.
ru: Показать все локальные нормативные акты.

# CoverAction_ShowAllLRD
source: Local regulation documents
ru: Локальные нормативные акты

# CoverAction_ShowAllBilaterial
source: HR bilaterial documents
ru: Кадровые договорные документы

# CoverDescription_ShowAllBilaterial
source: Show all bilaterial documents.
ru: Показать все кадровые договорные документы.

# CoverDescription_ShowAllPersonnel
source: Show all personnel documents.
ru: Показать все кадровые документы.

# CoverAction_ShowAllPersonnel
source: Personnel documents
ru: Кадровые документы

# CoverGroup_InformingGroup
source: Notifications
ru: Информирование

# CoverAction_CreateInformingTask
source: Send Notification
ru: Отправить уведомление

# CoverDescription_CreateInformingTask
source: Send an information message to employees.
ru: Отправить сообщение сотрудникам.

# CoverAction_ShowRoles
source: Roles
ru: Роли

# CoverDescription_ShowRoles
source: Include employees in roles.
ru: Назначить исполнителей ролей

# DisplayName
source: Document Management
ru: Кадровый ЭДО

# CoverDescription
source: This module is where you can automate HR document management.
ru: Модуль предназначен для автоматизации работы с кадровыми документами

# JobDisplayName_518fb541327043a48c7f387b05049628
source: HR Pro. Documents. Send notices on upcoming deadline for acquaintance tasks
ru: Кадровый ЭДО. Отправка уведомлений о приближении срока задач на ознакомление

# JobDescription_518fb541327043a48c7f387b05049628
source: Monitor tasks to acquaintant employees with HR documents and company regulations and send notices on upcoming deadline to task initiators.
ru: Отправка инициаторам уведомлений о приближении сроков задач на ознакомление с кадровыми документами и ЛНА.

# JobDisplayName_71e7f067ec7b4730aafa3fc4d4d1317e
source: HR Pro. Documents. Send notices on upcoming deadline for tasks to sign HR contractual documents
ru: Кадровый ЭДО. Отправка уведомлений о приближении срока задач на подписание кадровых договорных документов

# JobDescription_71e7f067ec7b4730aafa3fc4d4d1317e
source: Monitor tasks to sign HR contractual documents and send notices on upcoming deadline to task initiators.
ru: Отправка инициаторам уведомлений о приближении сроков задач на подписание кадровых договорных документов

# sf_b79b323f_c627_43d0_b9d0_88651df98924
source: To Control
ru: На контроль

# sf_7cf49851_f819_4ab4_b530_2ff5fd0edbcd
source: HR tasks
ru: Кадровые задачи

# FilterPanel_TaskTypeGroup_b6a8a81ac8e44ad7b98885bb7ed9deb9
source: Task Type
ru: ТИП ЗАДАЧИ

# FilterPanel_AcquaintanceTask_4bd8d601b97d407d99402bc54b49d924
source: Acquaintance
ru: Ознакомление

# FilterPanel_InformingTask_49722ff4c93a41fc9eb2b3f2d4421b27
source: Notification
ru: Информирование

# FilterPanel_SignTask_a42c04c032fb48b7a8868bc0e17183af
source: Signing
ru: Подписание

# FilterPanel_StartDateGroup_5efa7361ee574a7d8430319bb9c7a22a
source: Sent in the Last
ru: ОТПРАВЛЕНЫ ЗА ПОСЛЕДНИЕ

# FilterPanel_Today_ad5e8177e1b14f15b7492eed0c3a6108
source: 1 Day
ru: 1 день

# FilterPanel_ThirtyDays_afd5d4b17ddb4fcaa8b5cc95748f97e2
source: 30 Days
ru: 30 дней

# FilterPanel_NinetyDays_bd1e09e53fb64d7eb4bf7106ee9fedc5
source: 90 Days
ru: 90 дней

# FilterPanel_OneHundretEightyDays_efb1dc6ba8f94fb09c998458b60fdb38
source: 180 Days
ru: 180 дней

# FilterPanel_InitiatorGroup_b5920816b2d243f68d3a10bbda136f1d
source: Taks
ru: ЗАДАЧИ

# FilterPanel_MyTasks_b77fc1878d8e44cda2a6807353ce235e
source: Sent by Me
ru: Отправленные мной

# FilterPanel_AllInitiatorsTasks_ccc9f320bb2e447ba345eada252e9cd5
source: All
ru: Все

# FilterPanel_StatusGroup_73c0667e1bef4d469537f5bb3cac4179
source: STATUS
ru: СТАТУС

# FilterPanel_InProcess_fea464de59f744e4b8133a845a98a817
source: In process
ru: В работе

# FilterPanel_Completed_e9f0347683e345d0a82f1ab956a4edb8
source: Completed
ru: Завершена

# CoverGroup_LinksGroup
source: Links
ru: Связанная информация

# CoverAction_BusinessUnits
source: Business units
ru: Наши организации

# CoverDescription_BusinessUnits
source: Open business units.
ru: Открыть справочник Наши организации.

# CoverDescription_Departments
source: Open departments.
ru: Открыть справочник Подразделения.

# CoverAction_Departments
source: Departments
ru: Подразделения

# CoverAction_Employees
source: Employees
ru: Сотрудники

# CoverDescription_Employees
source: Open employees.
ru: Открыть справочник Сотрудники.

# CoverAction_CreateDocument
source: Create document
ru: Создать документ

# CoverDescription_CreateDocument
source: Create a hr or simple type of document.
ru: Быстрое создание кадровых документов.

# AsyncHandler_Description_34fb41b68e404a10bc87f07ae608d4b8
source: Update the Acquaintance List in the document version
ru: Обновить лист ознакомления в версии документа

# AsyncHandler_Description_bee72d3af26242c098184cdcc22b1c5d
source: Import organization structure
ru: Импорт оргструктуры предприятия

# CoverAction_StatementsSetting
source: Settings of Applications
ru: Настройки заявлений

# CoverDescription_StatementsSetting
source: Specify settings of employees' applications.
ru: Настроить заявления сотрудников.

# AsyncHandler_Description_b5b56e4ebcaf4dc39c3bba6fd2c66af8
source: Send notice with attachment.
ru: Отправить уведомление с вложением.

# CoverAction_TaskSettings
source: Configure Approval and Signing
ru: Настройки согласования и подписания

# CoverDescription_TaskSettings
source: Configure parameters of document approval and signing.
ru: Настроить параметры согласования и подписания документов

# AsyncHandler_Description_0eed5d8269b3499fb7307aa7976b1fa0
source: Create substitutions for all employees of person.
ru: AsyncHandler

# CoverGroup_Statements
source: Applications
ru: Заявления

# CoverAction_CreateStatement
source: Create statement
ru: Создать заявление

# CoverDescription_CreateStatement
source: Create and send an application.
ru: Создать и отправить заявление.

# CoverAction_MyStatements
source: Sent Applications
ru: Отправленные заявления

# CoverDescription_MyStatements
source: Show the list of sent applications.
ru: Открыть список моих отправленных заявлений.

# CoverAction_ShowAllStatements
source: Employees' Applications
ru: Заявления сотрудников

# CoverDescription_ShowAllStatements
source: View all employees' applications.
ru: Показать все заявления сотрудников.

# AsyncHandler_Description_dea5c6af48854c0a8e4b2e0eb342f85b
source: Refresh the "Consent for Digital HR Document Management" field in employee's card
ru: Обновление поля "Согласие на КЭДО" в карточке сотрудника.

# CoverAction_ConsentToKEDO
source: Send Consent for Digital HR Document Management
ru: Отправить Согласие на Кадровый ЭДО

# CoverDescription_ConsentToKEDO
source: Send Consent for Digital HR Document Management to employees for singning.
ru: Отправить сотрудникам Согласие на КЭДО для подписания.

# AsyncHandler_Description_61836113355048ba91d35b89bd618a94
source: Send the Consent for Digital HR Document Management to employee
ru: Отправка Согласия на КЭДО
