Repository: Micros11/base
Catalog: DirRX.VacationsUI/DirRX.VacationsUI.Shared/ModuleSystem.*.resx
Languages: ru

# CoverAction_ShowEmployeeVacation
source: My Vacations
ru: Мои отпуска

# CoverDescription_ShowEmployeeVacation
source: Show the list of scheduled and actual vacations.
ru: Информация о плановых и фактических отпусках.

# CoverTitle
source: Vacantions
ru: Отпуска

# CoverGroup_Vacantions
source: Vacantions
ru: Отпуска

# CoverAction_ApprovalVacation
source: Request Vacation
ru: Оформить отпуск

# CoverDescription_ApprovalVacation
source: Send a task to approve a vacation.
ru: Отправка задачи на оформление отпуска.

# CoverAction_ShiftVacation
source: Change Vacation Dates
ru: Оформить перенос отпуска

# CoverDescription_ShiftVacation
source: Send a task to change vacation dates.
ru: Отправка задачи на перенос отпуска.

# CoverAction_RecallVacation
source: Recall from Vacation
ru: Оформить отзыв из отпуска

# CoverDescription_RecallVacation
source: Send a task to recall an employee from vacation.
ru: Отправка задачи на отзыв из отпуска.

# CoverAction_ScheduleForm
source: Vacation Schedule with Overlaps
ru: График отпусков с пересечениями

# CoverDescription_ScheduleForm
source: Generate employees vacation schedule with overlaps.
ru: Формирование графика отпусков с пересечениями.

# CoverAction_Vacation
source: Vacations
ru: Отпуска

# CoverDescription_Vacation
source: Stores information about employees' vacations.
ru: Хранит информацию об отпусках сотрудников организации.

# DisplayName
source: Vacations
ru: Отпуска

# CoverGroup_ExportDocument
source: ExportDocument
ru: Выгрузка документов

# CoverAction_ExportVacationDocuments
source: Export Documents on Vacations
ru: Выгрузить документы по отпускам

# CoverDescription_ExportVacationDocuments
source: Export documents on vacations by specified parameters.
ru: Выгрузка документов по отпускам по заданным параметрам.

# CoverAction_ActualVacationReport
source: Current Vacation Statuses
ru: Актуальное состояние отпусков

# CoverDescription_ActualVacationReport
source: Generate a report on current vacation statuses.
ru: Формирование отчета об актуальном состоянии отпусков.

# CoverGroup_VacationManagement
source: Manage Vacations
ru: Управление отпусками

# CoverAction_VacationShedule
source: Initiate Vacations Scheduling
ru: Запустить планирование отпусков

# CoverDescription_VacationShedule
source: Send a task to schedule vacations in a business unit.
ru: Отправка задачи на планирование отпусков в организации.

# CoverAction_CreateSingleShedulingTask
source: Initiate Individual Vacation Scheduling
ru: Запустить индивидуальное планирование

# CoverDescription_CreateSingleShedulingTask
source: Send a task to schedule vacations of an employee.
ru: Отправка задачи на планирование отпусков сотрудника.

# CoverGroup_Setting
source: Settings
ru: Настройки

# CoverDescription_RoleSettings
source: Include employees to the list of roles' participants.
ru: Назначить исполнителей ролей по нашей организации.

# CoverAction_RoleSettings
source: Configure Participants of Roles Within Business Unit
ru: Роли в нашей организации

# CoverAction_ModuleSettings
source: Module Settings
ru: Настройки модуля

# CoverDescription_ModuleSettings
source: Configure the module settings.
ru: Задать настройки модуля.

# CoverAction_CreateSettingsReport
source: Check Configuration Consistency
ru: Проверить корректность настройки

# CoverDescription_CreateSettingsReport
source: Generate a report on consistency of the module configuration.
ru: Формирование отчета о корректности настройки модуля.
