Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/TaskSetting/TaskSettingSystem.*.resx
Languages: ru

# Property_Name
source: Task type
ru: Тип задачи

# DisplayName
source: Approval and Signing Setting
ru: Настройка согласования и подписания

# AccusativeDisplayName
source: Approval and Signing Setting
ru: Настройку согласования и подписания

# CollectionDisplayName
source: Approval and Signing Settings
ru: Настройки согласования и подписания

# Enum_SignQueue_WorkerFirst
source: Employee
ru: Сотрудник

# ControlGroup_df3bb43e2515445985422b5a97e6c6b6
source: Approve
ru: Согласование

# ControlGroup_54ab5817147945d5a3edcac5d79db4b0
source: Sign
ru: Подписание

# Property_DocumentKind
source: Document kind
ru: Вид документа

# Property_BusinessUnit
source: Business unit
ru: Наша организация

# Property_TaskType
source: Task type
ru: Тип задачи

# Property_Department
source: Department
ru: Подразделение

# Enum_ApprovalQueue_Parallel
source: Parallel
ru: Одновременно

# Enum_ApprovalQueue_Serially
source: Serially
ru: Друг за другом

# Property_ApprovalQueue
source: Start
ru: Старт

# Property_Approvers
source: Approvers
ru: Согласующие

# Property_ApproveDeadlineDays
source: Approval deadline (days)
ru: Срок согласования, дней

# Property_SignQueue
source: Who signs first
ru: Первым подписывает

# Property_Signer
source: Manager
ru: На подпись

# Property_SignerDealineDays
source: Deadline for signing by manager (days)
ru: Срок подписания руководителем, дней

# Property_EmployeeDealineDays
source: Deadline for signing by employee (days)
ru: Срок подписания сотрудниками, дней

# Property_TaskText
source: Task text
ru: Текст задачи

# Enum_SignQueue_EmployerFirst
source: Manager
ru: Руководитель

# Control_ff9175c5d4714c3faf8ff449be88f5d0_EmptyText
source: Specify approvers or leave the field blank if approval is not required.
ru: Укажите согласующих или оставьте поле пустым, если согласование не требуется.

# ControlGroup_9c6bc0ec84ae442eb4d330c9483ea169
source: Task text
ru: Текст задачи
