Repository: Micros11/base
Catalog: DirRX.EssPlatform/DirRX.EssPlatform.Shared/ModuleSystem.*.resx
Languages: ru

# CoverGroup_AdminGroup
source: Settings
ru: Администрирование

# CoverAction_InviteUsers
source: Invite users
ru: Подключение пользователей к сервису

# CoverDescription_InviteUsers
source: Send invitations to employees.
ru: Отправить пользователям ссылку-приглашение.

# AsyncHandler_Description_3c639b5bcbea4c2a95182664be64371e
source: Change the value of the "Invitation to ESS" field to "Accepted" after an employee accepts the Electronic Document Exchange Agreement.
ru: Обновление поля "Приглашение в личный кабинет" у сотрудника на "Принято" при принятии Соглашения об ЭДО.

# DisplayName
source: Personal account platform
ru: Платформа личного кабинета

# CoverAction_ShowEssSettings
source: Connection to employee self service
ru: Настройки подключения к личному кабинету

# CoverDescription_ShowEssSettings
source: Configure settings for interaction with еmployee self service.
ru: Параметры взаимодействия с сервисами личного кабинета.

# CoverTitle
source: Personal account platform
ru: Платформа личного кабинета

# CoverDescription
source: The module is designed to configure the personal account platform.
ru: Модуль предназначен для настройки платформы личного кабинета.

# AsyncHandler_Description_b440e7c9ea6d48a9adcd3e0504db378f
source: Activate ESS users
ru: Добавить пользователей в личный кабинет

# AsyncHandler_Description_bb2065e89a814c87bea19b104a135d29
source: SendSms
ru: AsyncHandler

# AsyncHandler_Description_873bcd17913f4fce83b566474fe0f665
source: SendSmsAsync
ru: AsyncHandler

# AsyncHandler_Description_d6ed7d2743234ea7bc12c9acf0cb8cca
source: SendMessageToViber
ru: AsyncHandler

# AsyncHandler_Description_6b7b3f5d09ea4f1d9f313050b488f4d3
source: SynchronizeEmployee
ru: Синхронизация полей в справочнике Сотрудники

# CoverAction_ShowRoles
source: Roles
ru: Роли

# CoverDescription_ShowRoles
source: Include employees in roles.
ru: Назначить исполнителей ролей
