Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/TransferTask/TransferTaskSystem.*.resx
Languages: ru

# Property_Department
source: New department
ru: Новое подразделение

# DisplayName
source: Task to Change Terms of Employment
ru: Задача на изменение условий труда

# AccusativeDisplayName
source: Task to Change Terms of Employment
ru: Задачу на изменение условий труда

# CollectionDisplayName
source: Tasks to Change Terms of Employment
ru: Задачи на изменение условий труда

# Control_679cef60166e482cbfa7a1ec861f0263_EmptyText
source: Specify observers…
ru: Укажите наблюдателей...

# Property_TransferDate
source: Date of change
ru: Дата изменений

# Property_AbortingReason
source: Reason
ru: Причина

# AttachmentGroup_HRDocumentAttachmentGroupTitle
source: HR Documents
ru: Кадровые документы

# AttachmentGroup_HRDocumentAttachmentGroupInformationMessage
source: No documents attached
ru: Документы не вложены

# Property_Employee
source: Employee
ru: Сотрудник

# Property_JobTitle
source: Job title
ru: Должность

# AttachmentGroup_EmploymentAttachmentGroupTitle
source: Employee
ru: Сотрудник

# AttachmentGroup_EmploymentAttachmentGroupInformationMessage
source: The databook record is attached automatically.
ru: Запись справочника вкладывается автоматически.

# AttachmentGroup_AdditionalAttachmentGroupTitle
source: Other
ru: Дополнительно

# AttachmentGroup_AdditionalAttachmentGroupInformationMessage
source: No attachments
ru: Вложений нет

# Action_StartHint
source: Send task
ru: Отправить задачу

# Action_StartDescription
source: Send the task and close its card.
ru: Отправка задачи и закрытие карточки

# Action_StartConfirmationMessage
source: Are you sure you want to send the task?
ru: Вы действительно хотите отправить задачу?

# Property_AdditionalAgreement
source: Supp. agreement to employment contract
ru: Доп. соглашение к трудовому договору

# Property_Order
source: Order
ru: Приказ

# ControlGroup_18cb5be2a8b241b4a86d22898e84a1c5
source: Information on Transfer
ru: Информация о переводе

# Footer_ActiveEmptyText
source: Enter text...
ru: Введите текст задачи...

# Property_IsHRStarted
source: Sent by HR
ru: Стартовал СОК

# Property_IsManagerStarted
source: Sent by manager
ru: Стартовал руководитель

# Property_IsTransfer
source: Transfer to another department
ru: Перевод в другое подразделение

# Property_SignImmediately
source: Approval by employee not required
ru: Согласование с сотрудником не требуется

# Property_OldDepartment
source: Department
ru: Подразделение

# ControlGroup_36f0d4b49a04492b8d6282dc2f8ee7be
source: Information on Changes in Terms of Employment
ru: Информация об изменениях условий труда

# Action_GenerateEmployeeDocuments
source: Create Documents
ru: Создать документы

# Action_GenerateEmployeeDocumentsHint
source: Generate Supplemental Agreement and Order
ru: Сформировать доп. соглашение к трудовому договору и приказ

# Action_GenerateEmployeeDocumentsDescription
source: Generate a supplemental agreement to the employment contract and an order related to the change in the terms of employment.
ru: Формирование доп. соглашения к трудовому договору и приказа при изменении условий труда сотрудника.

# Ribbon_GenerateAgreement_3223b01ef8094a7da951ccfeac4e04cf
source: Documents
ru: Документы

# Property_Statement
source: Letter
ru: Заявление

# ControlGroup_0610dbabdcbd460e974bf1a3c0d87acd
source: Guideline
ru: Инструкция
