Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/TransferTask/TransferTask.*.resx
Languages: ru

# AbortNotice
source: Transfer procedure aborted: {0}
ru: Прекращен перевод сотрудника: {0}

# ApprovalAssignmentSubject
source: Approve changes in employee's terms of employment: {0}
ru: Согласуйте изменение условий труда сотрудника: {0}

# CheckDocAssignmentInstruction
source: Check the order and supplemental agreement to the employement contract. Correct the documents if required and complete the assignment.
ru: Проверьте приказ и дополнительное соглашение. При необходимости скорректируйте документы. После проверки документов выполните задание.

# CheckDocAssignmentSubject
source: Check documents on changing employee working conditions: {0}
ru: Проверьте документы по изменению условий труда сотрудника: {0}

# SignAssignmentSubject
source: Sign documents on changes in terms of employment of employee: {0} with an electronic signature
ru: Подпишите ЭП документы по изменению условий труда сотрудника: {0}

# SignSeoAssignmentInstruction
source: Read the documents: 1. If the documents are correct, complete the assignment with the "Sign" result (the supplemental agreement and the order will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment description field and complete the assignment with the "For Rework" result.
ru: Ознакомьтесь с документами: 1. Если замечаний нет, выполните задание с результатом "Подписать" (доп. соглашение и приказ будут подписаны автоматически при выполнении задания). 2. Если есть замечания, укажите их в тексте задания и выполните его с результатом "На доработку".

# SignEmployeeAssignmenInstruction
source: Read the documents and complete the assignment with the "Sign" result (the supplemental agreement and the order will be signed automatically upon completion).
ru: Ознакомьтесь с документами и выполните задание с результатом "Подписать". Доп. соглашение и приказ будут подписаны автоматически при выполнении задания.

# ReWorkDocsAssignmentSubject
source: Rework documents on changes in employee's terms of employment: {0}
ru: Доработайте документы по изменению условий труда сотрудника: {0}

# ReWorkDocsAssignmentInstruction
source: Correct the documents in accordance with the specified remarks and complete the assignment with the "Corrected" result.
ru: Скорректируйте документы в соответствии с замечаниями и выполните задание с результатом "Исправлено".

# PreparingAssignmentSubject
source: Take necessary actions on transfer: {0}
ru: Выполните необходимые работы в связи с переводом сотрудника: {0}

# TransferTaskSubject
source: Change employee's terms of employment: {0}
ru: Изменение условий труда сотрудника: {0}

# HRApprovalAssignmentInstruction
source: Review the parameters of the letter: 1. If you have any remarks, correct the parameters of the letter and complete the assignment with the "Approve" result. 2. If the parameters are correct, make sure that the "Transfer date" field is filled in and complete the task with the "Approve" result. 3. If the letter should be denied, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с параметрами заявления: 1. Если есть замечания, то скорректируйте необходимые параметры заявления и выполните задание с результатом "Согласовать". 2. Если нет замечаний, убедитесь, что поле "Дата перевода" заполнено, и выполните задание с результатом "Согласовать". 3. Если необходимо отказать в согласовании, то укажите причину в тексте задания и выполните задание с результатом "Отказать".

# SignStatementAssignmentInstruction
source: Review the created letter: 1. If the letter is correct, complete the assignment with the "Sign" result (the letter will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Reapproval" result.
ru: Ознакомьтесь со сформированным заявлением: 1. Если нет замечаний, то выполните задание с результатом "Подписать" (заявление будет подписано автоматически при выполнении задания). 2. Если есть замечания, то укажите их в тексте задания и выполните задание с результатом "На повторное согласование".

# SignStatementAssignmentSubject
source: Review and sign transfer request letter with electronic signature
ru: Проверьте и подпишите ЭП заявление на перевод

# HRManagerApprovalAssignmentInstruction
source: Review the parameters of the letter: 1. If the parameters are correct, complete the task with the "Approve" result. 2. If you have any remarks or the transfer request letter should be denied, complete the assignment with the "Deny" result.
ru: Ознакомьтесь с параметрами заявления: 1. Если нет замечаний, то выполните задание с результатом "Согласовать". 2. Если есть замечания или необходимо отказать в согласовании, то выполните задание с результатом "Отказать".

# DeniedNoticeSubject
source: Changes in terms of employment of employee aborted: {0}
ru: Прекращен процесс изменения условий труда сотрудника: {0}

# SignAllPaperDocAssignmentInstruction
source: 1. Print out the supplemental agreement and order, and have their paper copies signed by the HR manager. 2. Have the paper copy of the supplemental agreement signed by the employee. Have the employee acquainted with the order with signed acknowledgement. Complete the assignment.
ru: 1. Распечатайте доп. соглашение, приказ и организуйте их подписание в бумажном виде директором по персоналу. 2. Организуйте подписание сотрудником в бумажном виде доп. соглашения. Ознакомьте под подпись сотрудника с приказом. Выполните задание.

# SignAllPaperDocAssignmentSubject
source: Have printed documents signed by employee: {0}
ru: Организуйте подписание документов в бумажном виде с сотрудником: {0}

# SignPaperAddAgreementAssignmentSubject
source: Have supplemental agreement signed by the employee: {0}
ru: Организуйте подписание доп. соглашения в бумажном виде с сотрудником: {0}

# SignPaperAddAgreementAssignmentInstruction
source: 1. Print out the supplemental agreement and have its paper copy signed by the HR manager. 2. Have the paper copy of the supplemental agreement signed by the employee. Complete the assignment.
ru: 1. Распечатайте доп. соглашение и организуйте его подписание в бумажном виде директором по персоналу. 2. Организуйте подписание в бумажном виде доп. соглашения сотрудником. Выполните задание.

# ErrorTextReWorkNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Rework" result.
ru: Перед выполнением задания с результатом "На доработку" укажите замечания в тексте задания.

# ErrorTextRefuseNoActiveText
source: Specify the reason for denial in the assignment text before you complete the assignment with the "Deny" result.
ru: Перед выполнением задания с результатом "Отказать" укажите причину в тексте задания.

# CurrentManagerApprovalAssignmentInstruction
source: Read the request to change the employee's terms of employment: 1. If the changes in terms of employment are related to the transfer of the employee to another department, select the "Transfer to another department" checkbox. 2. If the document is correct, specify terms of employment change date, and then complete the assignment with the "Approve" result. 3. If you have any remarks, specify them in the assignment description field and complete the assignment with the "For Rework" result. 4. If the letter should be denied, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с запросом на изменение условий труда сотрудника: 1. Если изменение условий труда связано с переводом в другое подразделение, установите флажок "Перевод в другое подразделение". 2. Если замечаний нет, укажите дату изменений условий труда и выполните задание с результатом "Согласовать". 3. Если есть замечания, укажите их в тексте задания и выполните его с результатом "На доработку". 4. Если необходимо отказать в согласовании, укажите причину в тексте задания и выполните его с результатом "Отказать".

# NewManagerApprovalAssignmentInstruction
source: Read the employee transfer parameters: 1. If the transfer parameters are correct, complete the assignment with the "Approve" result. 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result. 3. If you want to deny the transfer, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с параметрами перевода: 1. Если параметры указаны корректно, выполните задание с результатом "Согласовать". 2. Если замечания есть, укажите их в тексте задания и выполните его с результатом "На доработку". 3. Если необходимо отказать в переводе, укажите причину в тексте задания и выполните его с результатом "Отказать".

# AccountResponsibleAssignmentInstruction
source: Do the necessary financial operations and complete the assignment.
ru: Осуществите необходимые финансовые операции и выполните задание.

# ErrorTextReApproveNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Reapproval" result.
ru: Перед выполнением задания с результатом "На повторное согласование" укажите замечания в тексте задания.

# ActiveTextOnCreate
source: Please approve the transfer of the employee.
ru: Прошу согласовать перевод сотрудника.

# SignEmployeeAssignmentSubject
source: Sign documents on changes in terms of employment with an electronic signature
ru: Подпишите ЭП документы по изменению условий труда

# NeedGenerateOrderAndAgreement
source: Generate HR documents before you send the task.
ru: Перед стартом задачи сформируйте кадровые документы.

# EmptyActiveTextError
source: Specify what you want to change in terms of employment in the task text.
ru: Укажите желаемые изменения условий труда в тексте задачи.

# TransferTaskStartRoleError
source: Initiator of a task to change the employee's terms of employment cannot be a manager and {0} at the same time.
ru: Инициатор задачи на изменение условий труда сотрудника не может одновременно являться руководителем и {0}.

# SupplyResponsibleAssignmentInstruction
source: Provide the employee with the required goods and equipment and complete the assignment.
ru: Обеспечьте сотрудника необходимыми материальными ценностями и выполните задание.

# SecurityResponsibleAssignmentInstruction
source: Configure the employee's clearance level and access rights in accordance with the transfer and complete the assignment.
ru: Обеспечьте необходимые уровни допуска и права доступа в соответствии с переводом и выполните задание.

# ITResponsibleAssignmentInstruction
source: 1. Grant the employee required access rights. 2. Update the information on the employee's department and job title. 3. Provide the employee with the required goods, equipment, and software. 4. Complete the assignment.
ru: 1. Выдайте сотруднику необходимые права доступа. 2. Актуализируйте информацию о подразделении и должности сотрудника. 3. Обеспечьте сотрудника необходимыми техническими и программными ценностями. 4. Выполните задание.

# TransferStartError
source: Employee can be transferred to another department only upon his or her approval.
ru: Перевод в другое подразделение возможен только по согласованию с сотрудником.

# TranferTaskStartedManagersNotice
source: Changes in terms of employment of employee started: {0}
ru: Инициировано изменение условий труда сотрудника: {0}

# EmployeeStatemantAssignmentSubject
source: Approve changes in terms of employment
ru: Согласуйте изменение условий труда

# ManagersReworkNotice
source: Changes in terms of employment of employee corrected: {0}
ru: Доработаны изменения условий труда сотрудника: {0}

# ReWorkPrepareDocAssignmentSubject
source: Rework documents on changes in employee's terms of employment: {0}
ru: Доработайте документы по изменению условий труда сотрудника: {0}

# TransferApprovednotice
source: Changes in terms of employment of employee approved: {0}
ru: Согласовано изменение условий труда сотрудника: {0}

# TransferTaskStartedNotice
source: changes in terms of employment started
ru: Инициировано изменение условий труда

# TransferReWorkSubject
source: Rework desired changes in terms of employment
ru: Доработайте желаемые изменения условий труда

# EmployeeDeniedNoticeSubject
source: {0} did not accept changes in terms of employment
ru: {0} отказался от изменения условий труда

# HRTaskInstruction
source: 1. Specify parameters of changes in the employee's terms of employment. 2. If changes in terms of employment can be made without approval by the employee, select the "Approval by employee not required" checkbox. 3. If changes in terms of employment are related to the transfer of the employee to another department, select the "Transfer to another department" checkbox and fill in the "New department" and "Job title" fields. 4. Click the "Create Documents" button to generate a supplemental agreement and a terms of employment change order. Correct content of the documents if necessary.
ru: 1. Укажите параметры изменения условий труда сотрудника. 2. Если изменение условий труда не требует согласования с сотрудником, установите флажок "Согласование с сотрудником не требуется". 3. Если изменение условий труда сотрудника связано с переводом в другое подразделение, установите флажок "Перевод в другое подразделение" и заполните поля "Новое подразделение", "Должность". 4. Сформируйте доп. соглашение и приказ об изменении условий труда по кнопке "Создать документы". При необходимости скорректируйте их содержание.

# ManagerTaskInstruction
source: 1. Specify parameters of changes in the employee's terms of employment. 2. If changes in terms of employment are related to the transfer of the employee to another department, select the "Transfer to another department" checkbox and fill in the "New department" and "Job title" fields.
ru: 1. Укажите параметры изменения условий труда сотрудника. Дополнительную информацию укажите в тексте задачи. 2. Если изменение условий труда сотрудника связано с переводом в другое подразделение, установите флажок "Перевод в другое подразделение" и заполните поля "Новое подразделение", "Должность".

# EmployeeTaskInstruction
source: Specify what you want to change in terms of employment in the task text.
ru: Укажите желаемые изменения условий труда в тексте задачи.

# TransferDateError
source: Changes in terms of employment cannot predate the current date.
ru: Дата изменений должна быть больше сегодняшней даты.

# EmployeeReWorkInstruction
source: Read the comments left by the approver and correct the desired changes in terms of employment. Complete the assignment.
ru: Ознакомьтесь с замечаниями, доработайте желаемые изменения условий труда и выполните задание.

# EmployeeStetementInstruction
source: Read the attached documents: 1. If you have no remarks on the proposed changes, complete the assignment with the "Approve" result. 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result. 3. If you do not agree with the proposed changes in terms of employment, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с документами из области вложений: 1. Если замечания по предложенным изменениям отсутствуют, выполните задание с результатом "Согласовать". 2. Если есть замечания, укажите их в тексте задания и выполните его с результатом "На доработку". 3. Если не согласны с изменениями условий труда, укажите причину в тексте задания и выполните его с результатом "Прекратить".

# RePrepareDocAssignmentInstruction
source: Read the remarks, correct the documents, and complete the assignment.
ru: Ознакомьтесь с замечаниями, скорректируйте документы и выполните задание.

# EmployeeSelfStartStetementInstruction
source: Read the attached documents: 1. If you have no remarks on the proposed changes, complete the assignment with the "Approve" result. 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result. 3. If you do not agree with the proposed changes, specify the reason in the assignment text and complete the assignment with the "Abort" result.
ru: Ознакомьтесь с документами из области вложений: 1. Если замечаний по предложенным изменениям нет, выполните задание с результатом "Согласовать". 2. Если замечания есть, укажите их в тексте задания и выполните его с результатом "На доработку". 3. Если вы не согласны с предложенными изменениями, укажите причину в тексте задания и выполните его с результатом "Прекратить".

# NewManagerReApprovalAssignmentInstruction
source: Read the corrected employee's terms of employment: 1. If you have no remarks, complete the assignment with the "Approve" result. 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result. 3. If you want to deny the approval, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с доработанными изменениями условий труда сотрудника: 1. Если замечаний нет, выполните задание с результатом "Согласовать". 2. Если замечания есть, укажите их в тексте задания и выполните его с результатом "На доработку". 3. Если необходимо отказать в согласовании, укажите причину в тексте задания и выполните его с результатом "Отказать".

# ManagerReWorkInstruction
source: Read the remarks: 1. Correct parameters of changes in terms of employment. Correct the attached documents. Complete the assignment with the "Corrected" result. 2. If you want to abort approval of changes in terms of employment, specify the reason in the assignment text and complete the assignment with the "Abort" result.
ru: Ознакомьтесь с замечаниями: 1. Доработайте параметры изменения условий труда и документы из области вложений. Выполните задание с результатом "Исправлено". 2. Если необходимо прекратить процесс изменения условий труда, укажите причину в тексте задания и выполните его с результатом "Прекратить".

# TransferManagerReWorkSubject
source: Rework employee's terms of employment: {0}
ru: Доработайте параметры изменений условий труда сотрудника: {0}

# ReApprovalAssignmentSubject
source: Approve changes in employee's terms of employment: {0}
ru: Согласуйте изменения условий труда сотрудника: {0}

# CurrentManagerReApprovalAssignmentInstruction
source: Read the corrected changes in the employee's terms of employment: 1. If you have no remarks, specify necessary parameters and complete the assignment with the "Approve" result. 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result. 3. If you want to deny the approval, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с доработанными изменениями условий труда сотрудника: 1. Если замечаний нет, укажите необходимые параметры и выполните задание с результатом "Согласовать". 2. Если замечания есть, укажите их в тексте задания и выполните его с результатом "На доработку". 3. Если необходимо отказать в согласовании, укажите причину в тексте задания и выполните его с результатом "Отказать".

# NewManagerApprovalAssignmentSubject
source: Approve changes in employee's terms of employment: {0}
ru: Согласуйте параметры перевода сотрудника: {0}

# HRReWorkInstruction
source: Read the remarks: 1. Correct parameters of changes in terms of employment. Correct the attached documents. Complete the assignment with the "Corrected" result. 2. If you want to abort approval of changes in terms of employment, specify the reason in the assignment text and complete the assignment with the "Deny" result.
ru: Ознакомьтесь с замечаниями: 1. Доработайте параметры изменения условий труда и документы из области вложений по замечаниям. Выполните задание с результатом "Исправлено". 2. Если необходимо прекратить процесс изменения условий труда, укажите причину в тексте задания и выполните его с результатом "Отказать".
