Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/VacationSingleSchedulingTask/VacationSingleSchedulingTask.*.resx
Languages: ru

# TaskSubject
source: Schedule vacation of {1} for year {0}
ru: Планирование отпуска на {0} год сотрудника: {1}

# ManagerCheckInstruction
source: 1. Get acquainted with the planned vacations of the employee in the "Scheduled Vacations" table part. 2. Click "Show Overlaps" to check vacation overlaps with other employees if required. 3. If you have no remarks, complete the assignment with the "Endorse" result. 4. If you have any remarks, specify them in the assignment description field and complete the assignment with the "For Rework" result.
ru: 1. Ознакомьтесь с запланированными отпусками сотрудника в табличной части "Планируемые отпуска". 2. При необходимости проверьте пересечения с отпусками других сотрудников по кнопке "Посмотреть пересечения". 3. Если замечания отсутствуют, выполните задание с результатом "Согласовать". 4. Если есть замечания, укажите их в тексте задания и выполните его с результатом "На доработку".

# ManagerCheckSubject
source: Approve vacation of employee: {0}
ru: Согласуйте отпуск сотрудника: {0}

# SignStatementAssignmentInstruction
source: 1. Review the created letter. 2. If the letter is correct, complete the assignment with the "Sign" result (the letter will be signed automatically upon completion).
ru: 1. Ознакомьтесь со сформированным заявлением. 2. Выполните задание с результатом "Подписать" (заявление будет подписано автоматически при выполнении задания).

# SignStatementAssignmentSubject
source: Review and sign vacation request letter with electronic signature
ru: Проверьте и подпишите ЭП заявление на отпуск

# PrepareOrderAssignmentInstruction
source: 1. Check the order and correct it if necessary. 2. Complete the assignment.
ru: 1. Проверьте приказ, при необходимости скорректируйте сформированный документ. 2. Выполните задание.

# PrepareOrderAssignmentSubject
source: Check vacation order: {0}
ru: Проверьте приказ об отпуске сотрудника: {0}

# SignSeoAssignmentInstruction
source: Review the attached order: 1. If the order is correct, complete the assignment with the "Sign" result (the order will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result.
ru: Ознакомьтесь с приказом во вложении: 1. Если нет замечаний, выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания). 2. Если есть замечания, укажите их в тексте задания и выполните задание с результатом "На доработку".

# SignAssignmentSubject
source: Sign vacation order of {0} with your electronic signature
ru: Подпишите ЭП приказ об отпуске сотрудника: {0}

# VacationDocsReWorkAssignmentInstruction
source: Correct the order in accordance with the specified remarks and complete the assignment with the "Corrected" result.
ru: Доработайте приказ в соответствии с замечаниями и выполните задание с результатом "Исправлено".

# VacationDocsReWorkAssignmentSubject
source: Rework vacation order: {0}
ru: Доработайте приказ об отпуске сотрудника: {0}

# SignEmployeeAssignmentSubject
source: Review vacation order
ru: Ознакомьтесь с приказом об отпуске

# SignEmployeeAssignmenInstruction
source: Read the order and complete the assignment with the "Sign" result (the order will be signed automatically upon completion).
ru: Ознакомьтесь с приказом и выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания).

# AccounterAssignmentSubject
source: Take necessary actions on vacation: {0}
ru: Выполните необходимые работы в связи с отпуском сотрудника: {0}

# SignAllPaperDocAssignmentSubject
source: Have vacation request letter and vacation order of employee {0} signed
ru: Организуйте подписание в бумажном виде заявления и приказа об отпуске сотрудника: {0}

# SignAllPaperDocAssignmentInstruction
source: 1. Print out the order and have its hard copy signed by the HR manager. 2. Print out the vacation request letter. Have the employee sign the vacation request letter and read the vacation order with signed acknowledgement. 3. Complete the assignment.
ru: 1. Распечатайте приказ и организуйте его подписание в бумажном виде директором по персоналу. 2. Распечатайте заявление. Передайте заявление сотруднику для подписания в бумажном виде и приказ для ознакомления под подпись. 3. Выполните задание.

# EmployeeSchedulingSubject
source: Schedule vacation for year {0}
ru: Спланируйте отпуск на {0} год

# ErrorTextReWorkNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Rework" result.
ru: Перед выполнением задания с результатом "На доработку" укажите замечания в тексте задания.

# AbortNotice
source: Scheduling vacation of employee aborted: {0}
ru: Прекращено планирование отпуска сотрудника: {0}

# StartShedulingError
source: All vacations of {0} for year {1} are scheduled.
ru: Все отпуска {0} на {1} год распределены.

# EmployeeReworkSubject
source: Rework parameters of vacation
ru: Доработайте параметры отпуска

# EmployeeSchedulingInstruction
source: Days of vacation available: {0}
ru: Доступное количество дней отпуска: {0}

# FillTableInstruction
source: Schedule your vacation for year {0}: 1. Specify the desired dates in the "Scheduled Vacations" table. 2. Click "Show Overlaps" to check vacation overlaps. 3. Complete the assignment.
ru: Спланируйте отпуск на {0} год: 1. Укажите желаемые периоды отпуска в табличной части "Планируемые отпуска". 2. Проверьте пересечения отпусков в подразделении, нажав кнопку "Посмотреть пересечения". 3. Выполните задание.

# FillReworkTableInstruction
source: 1. Read the remarks. 2. Correct the parameters of the vacation and complete the assignment with the "Corrected" result.
ru: 1. Ознакомьтесь с замечаниями. 2. Доработайте параметры отпуска и выполните задание с результатом "Исправлено".
