Repository: Micros11/base
Catalog: DirRX.HRManagement/DirRX.HRManagement.Shared/VacationShiftTask/VacationShiftTask.*.resx
Languages: ru

# ShiftApprovalAssignmentSubject
source: Approve change of employee's vacation dates: {0}
ru: Согласуйте перенос отпуска сотрудника: {0}

# ErrorTextReWorkNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "For Rework" result.
ru: Перед выполнением задания с результатом "На доработку" укажите замечания в тексте задания.

# SignAssignmentSubject
source: Sign vacation dates change order with electronic signature: {0}
ru: Подпишите ЭП приказ о переносе отпуска сотрудника: {0}

# SignSeoAssignmentInstruction
source: Read the order: 1. If the order is correct, complete the assignment with the "Sign" result (the order will be signed automatically upon completion). 2. If you have any remarks, specify them in the assignment text and complete the assignment with the "For Rework" result.
ru: Ознакомьтесь с приказом: 1. Если замечания отсутствуют, то выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания). 2. Если имеются замечания, то укажите их в тексте задания и выполните задание с результатом "На доработку".

# PrepareOrderAssignmentSubject
source: Check vacation dates change order: {0}
ru: Проверьте приказ о переносе отпуска сотрудника: {0}

# PrepareOrderAssignmentInstruction
source: 1. Check the order and correct it if necessary. 2. Complete the assignment.
ru: 1. Проверьте приказ, при необходимости скорректируйте сформированный документ. 2. Выполните задание.

# VacationShiftTaskSubject
source: Change of vacation dates: {0}
ru: Перенос отпуска сотрудника: {0}

# VacationShiftTaskActiveText
source: Please approve the change of vacation dates.
ru: Прошу согласовать перенос отпуска.

# ShiftAbortNotice
source: Vacation dates change aborted: {0}
ru: Прекращен перенос отпуска сотрудника: {0}

# SignStatementAssignmentSubject
source: Review and sign letter on vacation dates change with electronic signature
ru: Проверьте и подпишите ЭП заявление на перенос отпуска

# SignStatementAssignmentInstruction
source: 1. Review the created letter. 2. Complete the assignment with the "Sign" result. The letter will be signed automatically.
ru: 1. Ознакомьтесь со сформированным заявлением. 2. Выполните задание с результатом "Подписать". Заявление будет подписано автоматически.

# SignAllPaperDocAssignmentInstruction
source: 1. Print out the order and have its hard copy signed by the HR manager. 2. Print out the letter, have its hard copy signed by the employee and have the employee read the order with signed acknowledgement. 3. Complete the assignment.
ru: 1. Распечатайте приказ и организуйте его подписание в бумажном виде директором по персоналу. 2. Распечатайте заявление и организуйте подписание в бумажном виде заявления и ознакомление с приказом под подпись сотрудником. 3. Выполните задание.

# SignAllPaperDocAssignmentSubject
source: Have employee sign hard copies of letter and order on vacation dates change: {0}
ru: Организуйте подписание в бумажном виде заявления и приказа о переносе отпуска сотрудника: {0}

# VacationDocsReWorkAssignmentSubject
source: Correct vacation dates change order: {0}
ru: Доработайте приказ о переносе отпуска сотрудника: {0}

# VacationDocsReWorkAssignmentInstruction
source: Correct the order in accordance with the specified remarks and complete the assignment with the "Corrected" result.
ru: Доработайте приказ в соответствии с замечаниями и выполните задание с результатом "Исправлено".

# SignEmployeeAssignmenInstruction
source: Read the order and complete the assignment with the "Sign" result (the order will be signed automatically upon completion).
ru: Ознакомьтесь с приказом и выполните задание с результатом "Подписать" (приказ будет подписан автоматически при выполнении задания).

# SignEmployeeAssignmentSubject
source: Review order on vacation dates change
ru: Ознакомьтесь с приказом о переносе отпуска

# ShiftReApproveInitiatorAssignmentSubject
source: Rework parameters of vacation dates change
ru: Доработайте параметры по переносу отпуска

# NotDistributedVacationDays
source: Days of vacation left to change: {0}
ru: Осталось перенести дней отпуска: {0}

# ShiftTemplateNewDates
source: from {0} to {1} - {2}
ru: с {0} по {1} - {2}

# StartDateLessTodayError
source: The beginning date must be greater than the current date.
ru: Дата начала должна быть больше сегодняшней даты.

# NeedSelectVacationForShift
source: Specify a vacation to change and new vacation dates.
ru: Необходимо указать отпуск для переноса и новые даты отпуска.

# EnterNewDates1
source: Specify the beginning and the duration of the first vacation part.
ru: Необходимо указать начало и количество дней первой части отпуска.

# EnterNewDates2
source: Specify the beginning and the duration of the second vacation part.
ru: Необходимо указать начало и количество дней второй части отпуска.

# EnterNewDates3
source: Specify the beginning and the duration of the third vacation part.
ru: Необходимо указать начало и количество дней третьей части отпуска.

# AllDistributedVacationDays
source: All vacation days scheduled.
ru: Распределены все дни отпуска.

# VacationDaysCanceled
source: Days canceled: {0}
ru: Отменено дней: {0}

# VacationDaysCompensationed
source: Days compensated: {0}
ru: Компенсировано дней: {0}

# VacationDaysRequiredToDistribute
source: Scheduling required
ru: Обязательно к распределению

# RecallReApproveInitiatorAssignmentSubject
source: Correct parameters of recall from vacation from {0}
ru: Доработайте параметры отзыва из отпуска с {0}

# RecallApprovalAssignmentSubject
source: Approve recall from vacation of employee {1} from {0}
ru: Согласуйте отзыв из отпуска c {0} сотрудника: {1}

# VacationRecallTaskSubject
source: Recall from vacation: {0}
ru: Отзыв из отпуска сотрудника: {0}

# StatementCompensationPart
source: {0} for {1} days
ru: {0} продолжительностью {1} календарных дней

# VacationRecallTaskActiveText
source: Please approve the recall from vacation.
ru: Прошу согласовать отзыв из отпуска.

# RecallAbortNotice
source: Recall from vacation aborted: {0}
ru: Прекращен отзыв из отпуска сотрудника: {0}

# SignRecallStatementAssignmentSubject
source: Review and sign letter on recall from vacation from {0} with electronic signature
ru: Проверьте и подпишите ЭП заявление на отзыв из отпуска с {0}

# PrepareRecallOrderAssignmentSubject
source: Check order on recall from vacation: {0}
ru: Проверьте приказ об отзыве из отпуска сотрудника: {0}

# SignAssignmentRecallSubject
source: Sign order on recall of {0} from vacation with your electronic signature
ru: Подпишите ЭП приказ об отзыве из отпуска сотрудника: {0}

# VacationRecallDocsReWorkAssignmentSubject
source: Rework order on recall from vacation: {0}
ru: Доработайте приказ об отзыве из отпуска сотрудника: {0}

# SignEmployeeRecallAssignmentSubject
source: Review order on recall from vacation
ru: Ознакомьтесь с приказом об отзыве из отпуска

# SignAllPaperRecallDocAssignmentSubject
source: Have letter and order on recall from vacation signed: {0}
ru: Организуйте подписание в бумажном виде заявления и приказа об отзыве из отпуска сотрудника: {0}

# RecallEmployeeApprovalAssignmentSubject
source: Approve recall from vacation from {0}
ru: Согласуйте отзыв из отпуска c {0}

# VacationRequiredDurationError
source: This is the only vacation period that meets the requirements to the duration of main vacation part. To ignore the requirements, select the "Do not check duration of vacation period" checkbox.
ru: Выбран единственный период отпуска, который отвечает требованиям к продолжительности одной части отпуска в организации. Чтобы отключить проверку для сотрудника, установите флажок "Отключить контроль продолжительности одной части отпуска".

# EnabledCompensation
source: Available if all days of annual paid vacation are scheduled
ru: Доступен, если распределены все дни основного отпуска

# VacationRequiredDurationWarning
source: This is the only vacation period that meets the requirements to the duration of main vacation part.
ru: Выбран единственный период отпуска, который отвечает требованиям к продолжительности одной части отпуска в организации.

# ShiftDeniedNoticeSubject
source: Change of vacation dates declined
ru: Отказано в переносе отпуска

# ShiftDeniedEmployeeNoticeSubject
source: Employee refused to change vacation dates: {0}
ru: Отказано в переносе отпуска сотрудником: {0}

# RecallDeniedNoticeSubject
source: Recall from vacation refused
ru: Отказано в отзыве из отпуска

# RecallDeniedEmployeeNoticeSubject
source: Employee refused to be recalled from vacation
ru: Отказано в отзыве из отпуска сотрудником: {0}

# ErrorTextDenyNoActiveText
source: Enter your remarks in the assignment text before you complete it with the "Deny" result.
ru: Перед выполнением задания с результатом "Отказать" укажите замечания в тексте задания.

# DeniedPersonnalOfficeNotice
source: {0} Reason: {1}
ru: {0} Причина: {1}
